
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>6 Incentive 奖励 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="7_Reclaiming_Disk_Space_回收硬盘空间.html" />
    
    
    <link rel="prev" href="5_Network_网络.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0_序言.html">
            
                <a href="0_序言.html">
            
                    
                    0 序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1_Introduction_简介.html">
            
                <a href="1_Introduction_简介.html">
            
                    
                    1 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.1_Transaction_交易_电子货币的定义.html">
            
                <a href="2.1_Transaction_交易_电子货币的定义.html">
            
                    
                    2.1 Transaction 交易 —— 电子货币的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="2.2_Transaction_交易_交易链的难点.html">
            
                <a href="2.2_Transaction_交易_交易链的难点.html">
            
                    
                    2.2 Transaction 交易 —— 交易链的难点
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="3_TimeStamp_Server_时间戳服务器.html">
            
                <a href="3_TimeStamp_Server_时间戳服务器.html">
            
                    
                    3 TimeStamp_Server 时间戳服务器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="4_Proof-of-Work_工作量证明.html">
            
                <a href="4_Proof-of-Work_工作量证明.html">
            
                    
                    4 Proof-of-Work 工作量证明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="5_Network_网络.html">
            
                <a href="5_Network_网络.html">
            
                    
                    5 Network 网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="6_Incentive_奖励.html">
            
                <a href="6_Incentive_奖励.html">
            
                    
                    6 Incentive 奖励
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="7_Reclaiming_Disk_Space_回收硬盘空间.html">
            
                <a href="7_Reclaiming_Disk_Space_回收硬盘空间.html">
            
                    
                    7 Reclaiming Disk Space 回收硬盘空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="8_Simplified_Payment_Verification_简化版支付确认.html">
            
                <a href="8_Simplified_Payment_Verification_简化版支付确认.html">
            
                    
                    8 Simplified Payment Verification 简化版支付确认
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="9_Combining_and_Splitting_Value_值的组合与分割.html">
            
                <a href="9_Combining_and_Splitting_Value_值的组合与分割.html">
            
                    
                    9 Combining and Splitting Value 值的组合与分割
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="10_Privacy_隐私.html">
            
                <a href="10_Privacy_隐私.html">
            
                    
                    10 Privacy 隐私
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="11_Calculations_计算.html">
            
                <a href="11_Calculations_计算.html">
            
                    
                    11 Calculations 计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="12_Conclusion_结论.html">
            
                <a href="12_Conclusion_结论.html">
            
                    
                    12 Conclusion 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="【附】白皮书_原文+翻译+单词注释.html">
            
                <a href="【附】白皮书_原文+翻译+单词注释.html">
            
                    
                    【附】白皮书 原文+翻译+单词注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="【附2】比特币相关网站.html">
            
                <a href="【附2】比特币相关网站.html">
            
                    
                    【附2】比特币相关网站
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="【附3】习题集.html">
            
                <a href="【附3】习题集.html">
            
                    
                    【附3】习题集
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >6 Incentive 奖励</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="6-&#x6FC0;&#x52B1;&#xFF08;incentive&#xFF09;">6 &#x6FC0;&#x52B1;&#xFF08;Incentive&#xFF09;</h1>
<h2 id="&#x539F;&#x6587;&#x4E0E;&#x7FFB;&#x8BD1;">&#x539F;&#x6587;&#x4E0E;&#x7FFB;&#x8BD1;</h2>
<p>By convention, the first transaction in a block is a special transaction that starts a new coin owned by the creator of the block. This adds an incentive for nodes to support the network, and provides a way to initially distribute coins into circulation, since there is no central authority to issue them. The steady addition of a constant of amount of new coins is analogous to gold miners expending resources to add gold to circulation. In our case, it is CPU time and electricity that is expended.</p>
<p>&#x6309;&#x7167;&#x7EA6;&#x5B9A;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x7B2C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5B83;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x679A;&#x65B0;&#x7684;&#x786C;&#x5E01;&#xFF0C;&#x6240;&#x5C5E;&#x6743;&#x662F;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x751F;&#x6210;&#x8005;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4F7F;&#x5F97;&#x8282;&#x70B9;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x6709;&#x6240;&#x5956;&#x52B1;&#xFF0C;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5C06;&#x786C;&#x5E01;&#x53D1;&#x884C;&#x5230;&#x6D41;&#x901A;&#x4E4B;&#x4E2D;&#x7684;&#x65B9;&#x5F0F; &#x2014;&#x2014; &#x5728;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x53CD;&#x6B63;&#x4E5F;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6743;&#x5A01;&#x65B9;&#x53BB;&#x53D1;&#x884C;&#x90A3;&#x4E9B;&#x786C;&#x5E01;&#x3002;&#x5982;&#x6B64;&#x8FD9;&#x822C;&#x7A33;&#x5B9A;&#x5730;&#x589E;&#x52A0;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x65B0;&#x786C;&#x5E01;&#x8FDB;&#x5165;&#x6D41;&#x901A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x662F;&#x9EC4;&#x91D1;&#x5F00;&#x91C7;&#x8005;&#x4E0D;&#x65AD;&#x8017;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x8D44;&#x6E90;&#x5F80;&#x6D41;&#x901A;&#x4E4B;&#x4E2D;&#x589E;&#x52A0;&#x9EC4;&#x91D1;&#x4E00;&#x6837;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x88AB;&#x8017;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x662F; CPU &#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x548C;&#x5B83;&#x4EEC;&#x6240;&#x7528;&#x7684;&#x7535;&#x529B;&#x3002;</p>
<p>The incentive can also be funded with transaction fees. If the output value of a transaction is less than its input value, the difference is a transaction fee that is added to the incentive value of the block containing the transaction. Once a predetermined number of coins have entered circulation, the incentive can transition entirely to transaction fees and be completely inflation free.</p>
<p>&#x5956;&#x52B1;&#x8FD8;&#x53EF;&#x4EE5;&#x6765;&#x81EA;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x5982;&#x679C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x503C;&#x5C0F;&#x4E8E;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4E2D;&#x7684;&#x5DEE;&#x989D;&#x5C31;&#x662F;&#x4EA4;&#x6613;&#x8D39;&#xFF1B;&#x800C;&#x8BE5;&#x4EA4;&#x6613;&#x8D39;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5956;&#x52B1;&#x8282;&#x70B9;&#x628A;&#x8BE5;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x8FDB;&#x6B64;&#x533A;&#x5757;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x65E2;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x786C;&#x5E01;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x6D41;&#x901A;&#xFF0C;&#x90A3;&#x4E48;&#x5956;&#x52B1;&#x5C06;&#x5168;&#x9762;&#x4EA4;&#x7531;&#x4EA4;&#x6613;&#x624B;&#x7EED;&#x8D39;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x4E14;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x6709;&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x3002;</p>
<p>The incentive may help encourage nodes to stay honest. If a greedy attacker is able to assemble more CPU power than all the honest nodes, he would have to choose between using it to defraud people by stealing back his payments, or using it to generate new coins. He ought to find it more profitable to play by the rules, such rules that favour him with more new coins than everyone else combined, than to undermine the system and the validity of his own wealth.</p>
<p>&#x5956;&#x52B1;&#x673A;&#x5236;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x9F13;&#x52B1;&#x8282;&#x70B9;&#x4FDD;&#x6301;&#x8BDA;&#x5B9E;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8D2A;&#x5A6A;&#x7684;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x7F51;&#x7F57;&#x6BD4;&#x6240;&#x6709;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x90FD;&#x66F4;&#x591A;&#x7684; CPU &#x7B97;&#x529B;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x662F;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x529B;&#x901A;&#x8FC7;&#x628A;&#x81EA;&#x5DF1;&#x82B1;&#x51FA;&#x53BB;&#x7684;&#x94B1;&#x5077;&#x56DE;&#x6765;&#x53BB;&#x6B3A;&#x9A97;&#x522B;&#x4EBA;&#x5462;&#xFF1F;&#x8FD8;&#x662F;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x529B;&#x53BB;&#x751F;&#x6210;&#x65B0;&#x7684;&#x786C;&#x5E01;&#xFF1F;&#x4ED6;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x6309;&#x7167;&#x89C4;&#x5219;&#x884C;&#x4E8B;&#x662F;&#x66F4;&#x5212;&#x7B97;&#x7684;&#xFF0C;&#x5F53;&#x524D;&#x89C4;&#x5219;&#x4F7F;&#x5F97;&#x4ED6;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x6BD4;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x52A0;&#x8D77;&#x6765;&#x90FD;&#x66F4;&#x591A;&#x7684;&#x786C;&#x5E01;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x6BD4;&#x6697;&#x4E2D;&#x6467;&#x6BC1;&#x7CFB;&#x7EDF;&#x5E76;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x8D22;&#x5BCC;&#x5316;&#x4E3A;&#x865A;&#x65E0;&#x66F4;&#x5212;&#x7B97;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x6316;&#x77FF;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x6316;&#x77FF;&#xFF1F;</h2>
<p>&#x6316;&#x77FF;&#x662F;&#x300C;&#x901A;&#x8FC7;&#x5BFB;&#x627E; Nonce &#x4EE5;&#x83B7;&#x5F97;&#x533A;&#x5757;&#x7684;&#x6253;&#x5305;&#x6743;&#x300D;&#x3002;
&#x627E;&#x5230; Nonce&#xFF0C;&#x6253;&#x5305;&#x4E86;&#x533A;&#x5757;&#x540E;&#xFF0C;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x9020;&#x5E01;&#x4EA4;&#x6613;&#xFF08;Coinbase Transaction&#xFF09;&#x751F;&#x6210;&#x67D0;&#x4E2A;&#x6570;&#x989D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x8FD9;&#x4E9B;&#x300C;&#x65B0;&#x5E01;&#x300D;&#x548C;&#x4EA4;&#x6613;&#x8D39;&#x4F5C;&#x4E3A;&#x5956;&#x52B1;&#x53D1;&#x7ED9;&#x300C;&#x77FF;&#x5DE5;&#x300D;&#x3002;</p>
<blockquote>
<p>&#x300C;&#x6316;&#x77FF;&#x300D;&#x8FD9;&#x4E2A;&#x8BCD;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8BEF;&#x5BFC;&#x6027;&#x3002;&#x5B83;&#x5BB9;&#x6613;&#x5F15;&#x8D77;&#x5BF9;&#x8D35;&#x91CD;&#x91D1;&#x5C5E;&#x91C7;&#x77FF;&#x7684;&#x8054;&#x60F3;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x6BCF;&#x4E2A;&#x65B0;&#x533A;&#x5FEB;&#x4EA7;&#x751F;&#x7684;&#x5956;&#x52B1;&#x4E0A;&#x3002;&#x5C3D;&#x7BA1;&#x6316;&#x77FF;&#x5E26;&#x6765;&#x7684;&#x5956;&#x52B1;&#x662F;&#x4E00;&#x79CD;&#x6FC0;&#x52B1;&#xFF0C;&#x4F46;&#x5B83;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x76EE;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x5956;&#x52B1;&#x672C;&#x8EAB;&#x6216;&#x8005;&#x65B0;&#x5E01;&#x7684;&#x4EA7;&#x751F;&#x3002;&#x5982;&#x679C;&#x53EA;&#x628A;&#x6316;&#x77FF;&#x770B;&#x4F5C;&#x751F;&#x4EA7;&#x65B0;&#x5E01;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x90A3;&#x4F60;&#x662F;&#x628A;&#x624B;&#x6BB5;&#xFF08;&#x6FC0;&#x52B1;&#x63AA;&#x65BD;&#xFF09;&#x5F53;&#x6210;&#x4E86;&#x76EE;&#x7684;&#x3002;&#x6316;&#x77FF;&#x662F;&#x4E00;&#x79CD;&#x5C06;&#x7ED3;&#x7B97;&#x6240;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7ED3;&#x7B97;&#x6240;&#x5BF9;&#x5904;&#x7406;&#x7684;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x548C;&#x7ED3;&#x7B97;&#x3002;<strong>&#x6316;&#x77FF;&#x4FDD;&#x62A4;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x73B0;&#x4E86;&#x5728;&#x6CA1;&#x6709;&#x4E2D;&#x5FC3;&#x673A;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x80FD;&#x4F7F;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;</strong></p>
<pre><code>                                                                &#x2014;&#x2014;&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x300B;
</code></pre></blockquote>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x6BD4;&#x7279;&#x5E01;&#x603B;&#x6570;&#x662F;2100&#x4E07;&#x679A;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x6BD4;&#x7279;&#x5E01;&#x603B;&#x6570;&#x662F;2100&#x4E07;&#x679A;&#xFF1F;</h2>
<p>&#x5BF9;&#x300C;&#x65B0;&#x5E01;&#x5956;&#x52B1;&#x300D;&#x7684;&#x8FC7;&#x7A0B;&#x6709;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x6BD4;&#x7279;&#x5E01;&#x603B;&#x6570;&#x662F;&#x56FA;&#x5B9A;&#x7684;2100&#x4E07;&#x679A;&#x3002;&#x8FD9;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x8BBE;&#x5B9A;&#x7684;&#x673A;&#x5236;&#x51B3;&#x5B9A;&#x7684;&#x2014;&#x2014;&#x6700;&#x5F00;&#x59CB;&#x6BCF;&#x300C;&#x5F00;&#x91C7;&#x300D;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5956;&#x52B1; 50 &#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6BCF;&#x8FFD;&#x52A0; 210,000 &#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x901F;&#x7387;&#x964D;&#x4F4E; 50% &#x3002;&#x76F4;&#x5230;&#x6BCF;&#x533A;&#x5757;&#x53D1;&#x884C;&#x6BD4;&#x7279;&#x5E01;&#x6570;&#x91CF;&#x53D8;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6700;&#x5C0F;&#x8D27;&#x5E01;&#x5355;&#x4F4D;&#x2014;&#x2014; 1 &#x806A;&#xFF0C;&#x8FD9;&#x65F6;&#x533A;&#x5757;&#x603B;&#x91CF;&#x4F1A;&#x5230;&#x8FBE; 1344 &#x4E07;&#x4E2A;&#xFF0C;&#x5E74;&#x4EFD;&#x662F; 2140 &#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x5F7C;&#x65F6;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6570;&#x91CF;&#x5C31;&#x662F; 2100 &#x4E07;&#x5DE6;&#x53F3;&#x4E86;&#x3002;</p>
<p><img src="pics/bitcoin_supplication.png" alt="&#x6BD4;&#x7279;&#x5E01;&#x4F9B;&#x5E94;&#x53D8;&#x5316;&#x66F2;&#x7EBF;"></p>
<p>&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x80FD;&#x770B;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x4E0B;&#x6B21;&#x51CF;&#x534A;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x6709;&#x610F;&#x601D;&#x7684;&#x6570;&#x636E;&#x2014;&#x2014;</p>
<p><a href="https://www.bitcoinblockhalf.com/" target="_blank">https://www.bitcoinblockhalf.com/</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="5_Network_网络.html" class="navigation navigation-prev " aria-label="Previous page: 5 Network 网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="7_Reclaiming_Disk_Space_回收硬盘空间.html" class="navigation navigation-next " aria-label="Next page: 7 Reclaiming Disk Space 回收硬盘空间">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"6 Incentive 奖励","level":"1.9","depth":1,"next":{"title":"7 Reclaiming Disk Space 回收硬盘空间","level":"1.10","depth":1,"path":"7_Reclaiming_Disk_Space_回收硬盘空间.md","ref":"7_Reclaiming_Disk_Space_回收硬盘空间.md","articles":[]},"previous":{"title":"5 Network 网络","level":"1.8","depth":1,"path":"5_Network_网络.md","ref":"5_Network_网络.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"6_Incentive_奖励.md","mtime":"2019-09-05T14:49:50.069Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-05T14:49:59.646Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

