
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <script id="MathJax-script" async
            src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js">
        </script>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>中文版 · 基于 JupyterLab 的比特币极速入门指南</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="李大狗">
        
        
    
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-base16-ateliersulphurpool.light.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-ace/ace.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-local-video/video-js.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-terminal/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    


    

        
    
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="bitcoin_whitepaper_en.html" />
    
    

    
    <link rel="stylesheet" href="gitbook/gitbook-plugin-chart/c3/c3.min.css">
    <script src="gitbook/gitbook-plugin-chart/c3/d3.min.js"></script>
    <script src="gitbook/gitbook-plugin-chart/c3/c3.min.js"></script>
    

    <script src="gitbook/gitbook-plugin-graph/d3.min.js"></script>
    <script src="gitbook/gitbook-plugin-graph/function-plot.js"></script>    

    <link href="https://bitcoin.doge.university/book/sitmap.xml" title="基于 JupyterLab 的比特币及速入门指南" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://bitcoin.doge.university" target="_blank" class="custom-link">Home</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="bitcoin_whitepaper_en.html">
            
                <a href="bitcoin_whitepaper_en.html">
            
                    
                    英文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="bitcoin_whitepaper_translated_words.html">
            
                <a href="bitcoin_whitepaper_translated_words.html">
            
                    
                    单词注释版
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >中文版</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-anchor"></i><ul><li><a href="#&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;">&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;</a></li><ul><li><a href="#1-&#x7B80;&#x4ECB;-introduction">1. &#x7B80;&#x4ECB; (Introduction)</a></li><li><a href="#2-&#x4EA4;&#x6613;-transactions">2. &#x4EA4;&#x6613; (Transactions)</a></li><li><a href="#3-&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;-timestamp-server">3. &#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668; (Timestamp Server)</a></li><li><a href="#4-&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;-proof-of-work">4. &#x5DE5;&#x4F5C;&#x8BC1;&#x660E; (Proof-of-Work)</a></li><li><a href="#5-&#x7F51;&#x7EDC;-network">5. &#x7F51;&#x7EDC; (Network)</a></li><li><a href="#6-&#x5956;&#x52B1;-incentive">6. &#x5956;&#x52B1; (Incentive)</a></li><li><a href="#7-&#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;-reclaiming-disk-space">7. &#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4; (Reclaiming Disk Space)</a></li><li><a href="#8-&#x7B80;&#x5316;&#x7248;&#x652F;&#x4ED8;&#x786E;&#x8BA4;-simplified-payment-verification">8. &#x7B80;&#x5316;&#x7248;&#x652F;&#x4ED8;&#x786E;&#x8BA4; (Simplified Payment Verification)</a></li><li><a href="#9-&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;-combining-and-splitting-value">9. &#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272; (Combining and Splitting Value)</a></li><li><a href="#10-&#x9690;&#x79C1;-privacy">10. &#x9690;&#x79C1; (Privacy)</a></li><li><a href="#11-&#x8BA1;&#x7B97;-calculations">11. &#x8BA1;&#x7B97; (Calculations)</a></li><li><a href="#12-&#x7ED3;&#x8BBA;-conclusion">12. &#x7ED3;&#x8BBA; (Conclusion)</a></li></ul></ul></div><a href="#&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;"><a name="&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;" class="anchor-navigation-ex-anchor" href="#&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6BD4;&#x7279;&#x5E01;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;</h1>
<pre class="language-"><code>                            &#x4F5C;&#x8005;&#xFF1A;&#x4E2D;&#x672C;&#x806A;
                            satoshin@gmx.com
                            www.bitcoin.org 
                            2008.10.31

                            &#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#xFF1A;&#x674E;&#x7B11;&#x6765;
                            lixiaolai@gmail.com
                            2018.10.31

(https://github.com/xiaolai/bitcoin-whitepaper-chinese-translation)
</code></pre><blockquote>
<p><strong>Abstract.</strong> A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network. The network timestamps transactions by hashing them into an ongoing chain of hash-based proof-of-work, forming a record that cannot be changed without redoing the proof-of-work. The longest chain not only serves as proof of the sequence of events witnessed, but proof that it came from the largest pool of CPU power. As long as a majority of CPU power is controlled by nodes that are not cooperating to attack the network, they&apos;ll generate the longest chain and outpace attackers. The network itself requires minimal structure. Messages are broadcast on a best effort basis, and nodes can leave and rejoin the network at will, accepting the longest proof-of-work chain as proof of what happened while they were gone. </p>
<p><strong>&#x6982;&#x8981;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x7EAF;&#x7CB9;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x7248;&#x672C;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x5141;&#x8BB8;&#x5728;&#x7EBF;&#x652F;&#x4ED8;&#x76F4;&#x63A5;&#x4ECE;&#x4E00;&#x65B9;&#x53D1;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x65B9;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x901A;&#x8FC7;&#x91D1;&#x878D;&#x673A;&#x6784;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x867D;&#x7136;&#x63D0;&#x4F9B;&#x4E86;&#x90E8;&#x5206;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#xFF0C;&#x82E5;&#x662F;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x88AB;&#x4FE1;&#x4EFB;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6765;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#x5C31;&#x88AB;&#x62B5;&#x6D88;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#xFF0C;&#x4F7F;&#x7528;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x53BB;&#x89E3;&#x51B3;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x95EE;&#x9898;&#x3002;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x5C06;&#x4E3A;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x6807;&#x8BB0;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#xFF1A;&#x628A;&#x4EA4;&#x6613;&#x7684;&#x6563;&#x5217;&#x6570;&#x636E;&#x5F55;&#x5165;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x5EF6;&#x5C55;&#x7684;&#x3001;&#x4EE5;&#x6563;&#x5217;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x94FE;&#x4E0A;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5982;&#x975E;&#x5B8C;&#x5168;&#x91CD;&#x505A;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x6539;&#x53D8;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x6700;&#x957F;&#x94FE;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x7528;&#x6765;&#x8BC1;&#x660E;&#x5DF2;&#x88AB;&#x89C1;&#x8BC1;&#x7684;&#x4E8B;&#x4EF6;&#x53CA;&#x5176;&#x987A;&#x5E8F;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x7528;&#x6765;&#x8BC1;&#x660E;&#x5B83;&#x6765;&#x81EA;&#x4E8E;&#x6700;&#x5927;&#x7684; CPU &#x7B97;&#x529B;&#x6C60;&#x3002;&#x53EA;&#x8981;&#x7EDD;&#x5927;&#x591A;&#x6570; CPU &#x7B97;&#x529B;&#x88AB;&#x826F;&#x6027;&#x8282;&#x70B9;&#x63A7;&#x5236; &#x2014;&#x2014; &#x5373;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x4E0E;&#x90A3;&#x4E9B;&#x5C1D;&#x8BD5;&#x653B;&#x51FB;&#x7F51;&#x7EDC;&#x7684;&#x8282;&#x70B9;&#x5408;&#x4F5C; &#x2014;&#x2014; &#x90A3;&#x4E48;&#xFF0C;&#x826F;&#x6027;&#x8282;&#x70B9;&#x5C06;&#x4F1A;&#x751F;&#x6210;&#x6700;&#x957F;&#x94FE;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x901F;&#x5EA6;&#x4E0A;&#x8D85;&#x8FC7;&#x653B;&#x51FB;&#x8005;&#x3002;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x672C;&#x8EAB;&#x9700;&#x8981;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x4FE1;&#x606F;&#x5C06;&#x4EE5;&#x6700;&#x5927;&#x52AA;&#x529B;&#x4E3A;&#x57FA;&#x672C;&#x53BB;&#x4F20;&#x64AD;&#xFF0C;&#x8282;&#x70B9;&#x6765;&#x53BB;&#x81EA;&#x7531;&#xFF1B;&#x4F46;&#xFF0C;&#x52A0;&#x5165;&#x4E4B;&#x65F6;&#x603B;&#x662F;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x6700;&#x957F;&#x7684;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x94FE;&#x4F5C;&#x4E3A;&#x5B83;&#x4EEC;&#x672A;&#x53C2;&#x4E0E;&#x671F;&#x95F4;&#x6240;&#x53D1;&#x751F;&#x4E4B;&#x4E00;&#x5207;&#x7684;&#x8BC1;&#x660E;&#x3002;</p>
</blockquote>
<hr>
<h2 id="1-&#x7B80;&#x4ECB;-introduction"><a name="1-&#x7B80;&#x4ECB;-introduction" class="anchor-navigation-ex-anchor" href="#1-&#x7B80;&#x4ECB;-introduction"><i class="fa fa-link" aria-hidden="true"></i></a>1. &#x7B80;&#x4ECB; (Introduction)</h2>
<p>Commerce on the Internet has come to rely almost exclusively on financial institutions serving as trusted third parties to process electronic payments. While the system works well enough for most transactions, it still suffers from the inherent weaknesses of the trust based model. Completely non-reversible transactions are not really possible, since financial institutions cannot avoid mediating disputes. The cost of mediation increases transaction costs, limiting the minimum practical transaction size and cutting off the possibility for small casual transactions, and there is a broader cost in the loss of ability to make non-reversible payments for non-reversible services. With the possibility of reversal, the need for trust spreads. Merchants must be wary of their customers, hassling them for more information than they would otherwise need. A certain percentage of fraud is accepted as unavoidable. These costs and payment uncertainties can be avoided in person by using physical currency, but no mechanism exists to make payments over a communications channel without a trusted party.</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x5546;&#x4E1A;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x91D1;&#x878D;&#x673A;&#x6784;&#x4F5C;&#x4E3A;&#x53EF;&#x4FE1;&#x7B2C;&#x4E09;&#x65B9;&#x53BB;&#x5904;&#x7406;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x3002;&#x867D;&#x7136;&#x9488;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x4EA4;&#x6613;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FD8;&#x7B97;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#xFF0C;&#x5B83;&#x4ECD;&#x7136;&#x88AB;&#x57FA;&#x4E8E;&#x4FE1;&#x4EFB;&#x7684;&#x6A21;&#x578B;&#x6240;&#x56FA;&#x6709;&#x7684;&#x7F3A;&#x9677;&#x6240;&#x62D6;&#x7D2F;&#x3002;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x4EA4;&#x6613;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x91D1;&#x878D;&#x673A;&#x6784;&#x4E0D;&#x80FD;&#x907F;&#x514D;&#x4EF2;&#x88C1;&#x4E89;&#x8BAE;&#x3002;&#x4EF2;&#x88C1;&#x6210;&#x672C;&#x589E;&#x52A0;&#x4E86;&#x4EA4;&#x6613;&#x6210;&#x672C;&#xFF0C;&#x8FDB;&#x800C;&#x9650;&#x5236;&#x4E86;&#x6700;&#x5C0F;&#x53EF;&#x80FD;&#x4EA4;&#x6613;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x4E14;&#x5E72;&#x8106;&#x963B;&#x6B62;&#x4E86;&#x5F88;&#x591A;&#x5C0F;&#x989D;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x66F4;&#x5927;&#x7684;&#x6210;&#x672C;&#xFF1A;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x4E3A;&#x90A3;&#x4E9B;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x652F;&#x4ED8;&#x3002;&#x9006;&#x8F6C;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x9020;&#x6210;&#x4E86;&#x5BF9;&#x4E8E;&#x4FE1;&#x4EFB;&#x7684;&#x9700;&#x6C42;&#x65E0;&#x6240;&#x4E0D;&#x5728;&#x3002;&#x5546;&#x5BB6;&#x5FC5;&#x987B;&#x63D0;&#x9632;&#x7740;&#x4ED6;&#x4EEC;&#x7684;&#x987E;&#x5BA2;&#xFF0C;&#x9EBB;&#x70E6;&#x987E;&#x5BA2;&#x63D0;&#x4F9B;&#x82E5;&#x975E;&#x5982;&#x6B64;&#xFF08;&#x5982;&#x82E5;&#x4FE1;&#x4EFB;&#xFF09;&#x5C31;&#x5E76;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;&#x7684;&#x6B3A;&#x8BC8;&#xFF0C;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x548C;&#x652F;&#x4ED8;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x867D;&#x7136;&#x5728;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7269;&#x7406;&#x8D27;&#x5E01;&#x652F;&#x4ED8;&#x7684;&#x65F6;&#x5019;&#x662F;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7684;&#xFF1B;&#x4F46;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x673A;&#x5236;&#x80FD;&#x5728;&#x53CC;&#x65B9;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x65B9;&#x4E0D;&#x88AB;&#x4FE1;&#x4EFB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x901A;&#x8FC7;&#x6C9F;&#x901A;&#x6E20;&#x9053;&#x8FDB;&#x884C;&#x652F;&#x4ED8;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x52A0;&#x5BC6;&#x8BC1;&#x660E;&#x800C;&#x975E;&#x57FA;&#x4E8E;&#x4FE1;&#x4EFB;&#x7684;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#xFF0C;&#x5141;&#x8BB8;&#x4EFB;&#x610F;&#x53CC;&#x65B9;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x4FE1;&#x4EFB;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x76F4;&#x63A5;&#x4EA4;&#x6613;&#x3002;&#x7B97;&#x529B;&#x4FDD;&#x969C;&#x7684;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x4EA4;&#x6613;&#x80FD;&#x5E2E;&#x52A9;&#x5356;&#x5BB6;&#x4E0D;&#x88AB;&#x6B3A;&#x8BC8;&#xFF0C;&#x800C;&#x4FDD;&#x62A4;&#x4E70;&#x5BB6;&#x7684;&#x65E5;&#x5E38;&#x62C5;&#x4FDD;&#x673A;&#x5236;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x672C;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x9488;&#x5BF9;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F7F;&#x7528;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#x53BB;&#x751F;&#x6210;&#x57FA;&#x4E8E;&#x7B97;&#x529B;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x6309;&#x7167;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x8BB0;&#x5F55;&#x6BCF;&#x6761;&#x4EA4;&#x6613;&#x3002;&#x6B64;&#x7CFB;&#x7EDF;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x603B;&#x4F53;&#x4E0A;&#x76F8;&#x5BF9;&#x4E8E;&#x76F8;&#x4E92;&#x5408;&#x4F5C;&#x7684;&#x653B;&#x51FB;&#x8005;&#x638C;&#x63E1;&#x66F4;&#x591A;&#x7684; CPU &#x7B97;&#x529B;&#x3002;</p>
<h2 id="2-&#x4EA4;&#x6613;-transactions"><a name="2-&#x4EA4;&#x6613;-transactions" class="anchor-navigation-ex-anchor" href="#2-&#x4EA4;&#x6613;-transactions"><i class="fa fa-link" aria-hidden="true"></i></a>2. &#x4EA4;&#x6613; (Transactions)</h2>
<p>We define an electronic coin as a chain of digital signatures. Each owner transfers the coin to the next by digitally signing a hash of the previous transaction and the public key of the next owner and adding these to the end of the coin. A payee can verify the signatures to verify the chain of ownership.</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4E00;&#x679A;&#x7535;&#x5B50;&#x786C;&#x5E01;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x94FE;&#x3002;&#x4E00;&#x4F4D;&#x6240;&#x6709;&#x8005;&#x5C06;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x4EA4;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x901A;&#x8FC7;&#x5728;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x94FE;&#x7684;&#x672B;&#x5C3E;&#x9644;&#x52A0;&#x4E0A;&#x4EE5;&#x4E0B;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF1A;&#x4E0A;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x54C8;&#x5E0C;&#xFF08;hash&#xFF0C;&#x97F3;&#x8BD1;&#xFF0C;&#x4EA6;&#x7FFB;&#x8BD1;&#x4E3A;&#x201C;&#x6563;&#x5217;&#x503C;&#x201D;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x65B0;&#x6240;&#x6709;&#x8005;&#x7684;&#x516C;&#x94A5;&#x3002;&#x6536;&#x6B3E;&#x4EBA;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x53BB;&#x9A8C;&#x8BC1;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x94FE;&#x7684;&#x6240;&#x5C5E;&#x6743;&#x3002;</p>
<p><img src="pics/transactions.svg" alt=""></p>
<p>The problem of course is the payee can&apos;t verify that one of the owners did not double-spend the coin. A common solution is to introduce a trusted central authority, or mint, that checks every transaction for double spending. After each transaction, the coin must be returned to the mint to issue a new coin, and only coins issued directly from the mint are trusted not to be double-spent. The problem with this solution is that the fate of the entire money system depends on the company running the mint, with every transaction having to go through them, just like a bank.</p>
<p>&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x6536;&#x6B3E;&#x4EBA;&#x65E0;&#x6CD5;&#x9A8C;&#x8BC1;&#x66FE;&#x7ECF;&#x7684;&#x6240;&#x6709;&#x8005;&#x4E4B;&#x4E2D;&#x6CA1;&#x6709;&#x4EBA;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x8FC7;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x53EF;&#x4FE1;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x6743;&#x5A01;&#x65B9;&#xFF0C;&#x6216;&#x79F0;&#x201C;&#x94F8;&#x5E01;&#x5382;&#x201D;&#xFF0C;&#x8BA9;&#x5B83;&#x53BB;&#x68C0;&#x67E5;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x5B58;&#x5728;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x53D1;&#x751F;&#x4EA4;&#x6613;&#x4E4B;&#x540E;&#xFF0C;&#x786C;&#x5E01;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5230;&#x94F8;&#x5E01;&#x5382;&#xFF0C;&#x94F8;&#x5E01;&#x5382;&#x518D;&#x53D1;&#x884C;&#x4E00;&#x679A;&#x65B0;&#x7684;&#x786C;&#x5E01;&#x3002;&#x8FDB;&#x800C;&#xFF0C;&#x53EA;&#x6709;&#x94F8;&#x5E01;&#x5382;&#x76F4;&#x63A5;&#x53D1;&#x884C;&#x7684;&#x786C;&#x5E01;&#x624D;&#x662F;&#x53EF;&#x4FE1;&#x7684;&#x3001;&#x672A;&#x88AB;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x8FC7;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x6574;&#x4E2A;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x547D;&#x8FD0;&#x88AB;&#x62F4;&#x5728;&#x8FD0;&#x8425;&#x94F8;&#x5E01;&#x5382;&#x7684;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#xFF08;&#x5C31;&#x597D;&#x50CF;&#x94F6;&#x884C;&#x90A3;&#x6837;&#xFF09;&#x8EAB;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5B83;&#x3002;</p>
<p>We need a way for the payee to know that the previous owners did not sign any earlier transactions. For our purposes, the earliest transaction is the one that counts, so we don&apos;t care about later attempts to double-spend. The only way to confirm the absence of a transaction is to be aware of all transactions. In the mint based model, the mint was aware of all transactions and decided which arrived first. To accomplish this without a trusted party, transactions must be publicly announced[1], and we need a system for participants to agree on a single history of the order in which they were received. The payee needs proof that at the time of each transaction, the majority of nodes agreed it was the first received.</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6536;&#x6B3E;&#x4EBA;&#x786E;&#x8BA4;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x8005;&#x5E76;&#x6CA1;&#x6709;&#x5728;&#x4EFB;&#x4F55;&#x4E4B;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x4E0A;&#x7B7E;&#x540D;&#x3002;&#x5C31;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x800C;&#x8A00;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x65E9;&#x7684;&#x4EA4;&#x6613;&#x662F;&#x7B97;&#x6570;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x5176;&#x540E;&#x7684;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x4F01;&#x56FE;&#x3002;&#x786E;&#x8BA4;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x83B7;&#x6089;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x94F8;&#x5E01;&#x5382;&#x6A21;&#x578B;&#x4E4B;&#x4E2D;&#xFF0C;&#x94F8;&#x5E01;&#x5382;&#x5DF2;&#x7136;&#x77E5;&#x6089;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x786E;&#x8BA4;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x5728;&#x6CA1;&#x6709;&#x201C;&#x88AB;&#x4FE1;&#x4EFB;&#x7684;&#x4E00;&#x65B9;&#x201D;&#x53C2;&#x4E0E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B8C;&#x6210;&#x4EE5;&#x4E0A;&#x4EFB;&#x52A1;&#xFF0C;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x5FC5;&#x987B;&#x88AB;&#x516C;&#x5F00;&#x5BA3;&#x5E03;<sup><a href="#fn_1" id="reffn_1">1</a></sup>&#xFF0C;&#x8FDB;&#x800C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x80FD;&#x8BA9;&#x53C2;&#x4E0E;&#x8005;&#x4EEC;&#x8BA4;&#x540C;&#x5B83;&#x4EEC;&#x6240;&#x63A5;&#x6536;&#x5230;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x4EA4;&#x6613;&#x5386;&#x53F2;&#x3002;&#x6536;&#x6B3E;&#x4EBA;&#x9700;&#x8981;&#x8BC1;&#x660E;&#x5728;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#x4E4B;&#x65F6;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x8BA4;&#x540C;&#x5B83;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x88AB;&#x63A5;&#x6536;&#x7684;&#x3002;</p>
<h2 id="3-&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;-timestamp-server"><a name="3-&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;-timestamp-server" class="anchor-navigation-ex-anchor" href="#3-&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;-timestamp-server"><i class="fa fa-link" aria-hidden="true"></i></a>3. &#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668; (Timestamp Server)</h2>
<p>The solution we propose begins with a timestamp server. A timestamp server works by taking a hash of a block of items to be timestamped and widely publishing the hash, such as in a newspaper or Usenet post<sup><a href="#fn_2" id="reffn_2">2</a></sup> <sup><a href="#fn_3" id="reffn_3">3</a></sup> <sup><a href="#fn_4" id="reffn_4">4</a></sup> <sup><a href="#fn_5" id="reffn_5">5</a></sup>. The timestamp proves that the data must have existed at the time, obviously, in order to get into the hash. Each timestamp includes the previous timestamp in its hash, forming a chain, with each additional timestamp reinforcing the ones before it.</p>
<p>&#x672C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x8D77;&#x6B65;&#x4E8E;&#x4E00;&#x79CD;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#x3002;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#xFF1A;&#x4E3A;&#x4E00;&#x7EC4;&#xFF08;block&#xFF09;&#x8BB0;&#x5F55;&#xFF08;items&#xFF09;&#x7684;&#x54C8;&#x5E0C;&#x6253;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x800C;&#x540E;&#x628A;&#x54C8;&#x5E0C;&#x5E7F;&#x64AD;&#x51FA;&#x53BB;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4E00;&#x4EFD;&#x62A5;&#x7EB8;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6216;&#x8005;&#x50CF;&#x662F;&#x5728;&#x65B0;&#x95FB;&#x7EC4;&#xFF08;Usenet&#xFF09;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x5E16;&#x5B50;&#x90A3;&#x6837;<sup><a href="#fn_2" id="reffn_2">2</a></sup> <sup><a href="#fn_3" id="reffn_3">3</a></sup> <sup><a href="#fn_4" id="reffn_4">4</a></sup> <sup><a href="#fn_5" id="reffn_5">5</a></sup>&#x3002;&#x663E;&#x7136;&#xFF0C;&#x65F6;&#x95F4;&#x6233;&#x80FD;&#x591F;&#x8BC1;&#x660E;&#x90A3;&#x6570;&#x636E;&#x5728;&#x90A3;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x4E4B;&#x524D;&#x5DF2;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x5426;&#x5219;&#x90A3;&#x54C8;&#x5E0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x751F;&#x6210;&#x3002;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x5728;&#x5176;&#x54C8;&#x5E0C;&#x4E2D;&#x5305;&#x542B;&#x7740;&#x4E4B;&#x524D;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x56E0;&#x6B64;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x94FE;&#xFF0C;&#x6B64;&#x6761;&#x94FE;&#x4E0A;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x88AB;&#x6DFB;&#x52A0;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4E4B;&#x540E;&#x3002;</p>
<p><img src="pics/timestamp-server.svg" alt="timestamp_server"></p>
<h2 id="4-&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;-proof-of-work"><a name="4-&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;-proof-of-work" class="anchor-navigation-ex-anchor" href="#4-&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;-proof-of-work"><i class="fa fa-link" aria-hidden="true"></i></a>4. &#x5DE5;&#x4F5C;&#x8BC1;&#x660E; (Proof-of-Work)</h2>
<p>To implement a distributed timestamp server on a peer-to-peer basis, we will need to use a proof-of-work system similar to Adam Back&apos;s Hashcash<sup><a href="#fn_6" id="reffn_6">6</a></sup>, rather than newspaper or Usenet posts. The proof-of-work involves scanning for a value that when hashed, such as with SHA-256, the hash begins with a number of zero bits. The average work required is exponential in the number of zero bits required and can be verified by executing a single hash.</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x4E9A;&#x5F53;&#xB7;&#x4F2F;&#x514B;&#x7684;&#x54C8;&#x5E0C;&#x73B0;&#x91D1;<sup><a href="#fn_6" id="reffn_6">6</a></sup>&#x90A3;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x62A5;&#x7EB8;&#x6216;&#x8005;&#x65B0;&#x95FB;&#x7EC4;&#x5E16;&#x5B50;&#x90A3;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6240;&#x8C13;&#x7684;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#xFF0C;&#x5C31;&#x662F;&#x53BB;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#xFF1B;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x8981;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#xFF1A;&#x4E3A;&#x5B83;&#x63D0;&#x53D6;&#x6563;&#x5217;&#x6570;&#x503C;&#x4E4B;&#x540E; &#x2014;&#x2014; &#x4F8B;&#x5982;&#x4F7F;&#x7528; SHA-256 &#x8BA1;&#x7B97;&#x6563;&#x5217;&#x6570;&#x503C; &#x2014;&#x2014; &#x8FD9;&#x4E2A;&#x6563;&#x5217;&#x6570;&#x503C;&#x5FC5;&#x987B;&#x4EE5;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684; 0 &#x5F00;&#x5934;&#x3002;&#x6BCF;&#x589E;&#x52A0;&#x4E00;&#x4E2A; 0 &#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5C06;&#x4F7F;&#x5F97;&#x5DE5;&#x4F5C;&#x91CF;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x52A0;&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x9A8C;&#x8BC1;&#x5374;&#x53EA;&#x9700;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x3002;</p>
<p>For our timestamp network, we implement the proof-of-work by incrementing a nonce in the block until a value is found that gives the block&apos;s hash the required zero bits. Once the CPU effort has been expended to make it satisfy the proof-of-work, the block cannot be changed without redoing the work. As later blocks are chained after it, the work to change the block would include redoing all the blocks after it.</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x7684;&#xFF1A;&#x4E0D;&#x65AD;&#x5728;&#x533A;&#x5757;&#x4E4B;&#x4E2D;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#xFF08;Nonce&#xFF09;&#xFF0C;&#x76F4;&#x5230;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x6570;&#x503C;&#x88AB;&#x627E;&#x5230;&#xFF1B;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x5C31;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x4EE5;&#x6307;&#x5B9A;&#x6570;&#x91CF;&#x7684; 0 &#x5F00;&#x5934;&#x3002;&#x4E00;&#x65E6; CPU &#x7684;&#x8017;&#x8D39;&#x7B97;&#x529B;&#x6240;&#x83B7;&#x7684;&#x7684;&#x7ED3;&#x679C;&#x6EE1;&#x8DB3;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x5C06;&#x4E0D;&#x518D;&#x80FD;&#x88AB;&#x66F4;&#x6539;&#xFF0C;&#x9664;&#x975E;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x968F;&#x7740;&#x65B0;&#x7684;&#x533A;&#x5757;&#x4E0D;&#x65AD;&#x88AB;&#x6DFB;&#x52A0;&#x8FDB;&#x6765;&#xFF0C;&#x6539;&#x53D8;&#x5F53;&#x524D;&#x533A;&#x5757;&#x5373;&#x610F;&#x5473;&#x7740;&#x8BF4;&#x8981;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x5176;&#x540E;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><img src="pics/proof-of-work.png" alt="proof-of-work"></p>
<p>The proof-of-work also solves the problem of determining representation in majority decision making. If the majority were based on one-IP-address-one-vote, it could be subverted by anyone able to allocate many IPs. Proof-of-work is essentially one-CPU-one-vote. The majority decision is represented by the longest chain, which has the greatest proof-of-work effort invested in it. If a majority of CPU power is controlled by honest nodes, the honest chain will grow the fastest and outpace any competing chains. To modify a past block, an attacker would have to redo the proof-of-work of the block and all blocks after it and then catch up with and surpass the work of the honest nodes. We will show later that the probability of a slower attacker catching up diminishes exponentially as subsequent blocks are added.</p>
<p>&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x4E86;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x8C01;&#x80FD;&#x4EE3;&#x8868;&#x5927;&#x591A;&#x6570;&#x505A;&#x51B3;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5927;&#x591A;&#x6570;&#x201D;&#x662F;&#x57FA;&#x4E8E;&#x201C;&#x4E00;&#x4E2A; IP &#x5730;&#x5740;&#x4E00;&#x7968;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x51B3;&#x5B9A;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x5F88;&#x591A; IP &#x5730;&#x5740;&#x7684;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x5927;&#x591A;&#x6570;&#x201D;&#x3002;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x662F;&#x201C;&#x4E00;&#x4E2A; CPU&#xFF08;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4EFD;&#x7B97;&#x529B;&#xFF09; &#x4E00;&#x7968;&#x201D;&#x3002;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5927;&#x591A;&#x6570;&#x51B3;&#x5B9A;&#x201D;&#x662F;&#x7531;&#x6700;&#x957F;&#x94FE;&#x6240;&#x4EE3;&#x8868;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x88AB;&#x6295;&#x5165;&#x6700;&#x591A;&#x5DE5;&#x4F5C;&#x7684;&#x94FE;&#x5C31;&#x662F;&#x5B83;&#x3002;&#x5982;&#x679C;&#x5927;&#x591A;&#x6570; CPU &#x7B97;&#x529B;&#x88AB;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x6240;&#x63A7;&#x5236;&#xFF0C;&#x90A3;&#x4E48;&#x8BDA;&#x5B9E;&#x94FE;&#x6210;&#x957F;&#x6700;&#x4E3A;&#x8FC5;&#x901F;&#xFF0C;&#x5176;&#x901F;&#x5EA6;&#x4F1A;&#x8FDC;&#x8D85;&#x5176;&#x4ED6;&#x7ADE;&#x4E89;&#x94FE;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x6539;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x90A3;&#x4E2A;&#x533A;&#x5757;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x5176;&#x540E;&#x533A;&#x5757;&#x7684;&#x7684;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#xFF0C;&#x800C;&#x540E;&#x8FD8;&#x8981;&#x8FFD;&#x4E0A;&#x5E76;&#x8D85;&#x8FC7;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x540E;&#x6587;&#x5C55;&#x793A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x4E2A;&#x88AB;&#x62D6;&#x5EF6;&#x4E86;&#x7684;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x8FFD;&#x4E0A;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C06;&#x968F;&#x7740;&#x533A;&#x5757;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x800C;&#x6307;&#x6570;&#x7EA7;&#x964D;&#x4F4E;&#x3002;</p>
<p>To compensate for increasing hardware speed and varying interest in running nodes over time, the proof-of-work difficulty is determined by a moving average targeting an average number of blocks per hour. If they&apos;re generated too fast, the difficulty increases.</p>
<p>&#x4E3A;&#x4E86;&#x5E94;&#x5BF9;&#x786C;&#x4EF6;&#x7B97;&#x529B;&#x7EFC;&#x5408;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x4EE5;&#x53CA;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x8FDB;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x7684;&#x8282;&#x70B9;&#x53C2;&#x4E0E;&#x6570;&#x91CF;&#x53D8;&#x5316;&#xFF0C;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x96BE;&#x5EA6;&#x7531;&#x6B64;&#x51B3;&#x5B9A;&#xFF1A;&#x57FA;&#x4E8E;&#x5E73;&#x5747;&#x6BCF;&#x5C0F;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#x6570;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x5E73;&#x5747;&#x503C;&#x3002;&#x5982;&#x679C;&#x533A;&#x5757;&#x751F;&#x6210;&#x5F97;&#x8FC7;&#x5FEB;&#xFF0C;&#x90A3;&#x4E48;&#x96BE;&#x5EA6;&#x5C06;&#x4F1A;&#x589E;&#x52A0;&#x3002;</p>
<h2 id="5-&#x7F51;&#x7EDC;-network"><a name="5-&#x7F51;&#x7EDC;-network" class="anchor-navigation-ex-anchor" href="#5-&#x7F51;&#x7EDC;-network"><i class="fa fa-link" aria-hidden="true"></i></a>5. &#x7F51;&#x7EDC; (Network)</h2>
<p>The steps to run the network are as follows:</p>
<blockquote>
<ol>
<li>New transactions are broadcast to all nodes.</li>
<li>Each node collects new transactions into a block.</li>
<li>Each node works on finding a difficult proof-of-work for its block.</li>
<li>When a node finds a proof-of-work, it broadcasts the block to all nodes.</li>
<li>Nodes accept the block only if all transactions in it are valid and not already spent.</li>
<li>Nodes express their acceptance of the block by working on creating the next block in the chain, using the hash of the accepted block as the previous hash.</li>
</ol>
</blockquote>
<p>&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#x7684;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<blockquote>
<ol>
<li>&#x6240;&#x6709;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x5411;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5E7F;&#x64AD;&#xFF1B;</li>
<li>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5C06;&#x65B0;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x5230;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF1B;</li>
<li>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5F00;&#x59CB;&#x4E3A;&#x6B64;&#x533A;&#x5757;&#x627E;&#x4E00;&#x4E2A;&#x5177;&#x5907;&#x96BE;&#x5EA6;&#x7684;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#xFF1B;</li>
<li>&#x5F53;&#x67D0;&#x4E2A;&#x533A;&#x5757;&#x627E;&#x5230;&#x5176;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#xFF0C;&#x5B83;&#x5C31;&#x8981;&#x5C06;&#x6B64;&#x533A;&#x5757;&#x5E7F;&#x64AD;&#x7ED9;&#x6240;&#x6709;&#x8282;&#x70B9;&#xFF1B;</li>
<li>&#x4F17;&#x591A;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5F53;&#x4E14;&#x53EA;&#x5F53;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x6EE1;&#x8DB3;&#x624D;&#x4F1A;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#xFF1A;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4E14;&#x672A;&#x88AB;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#xFF1B;</li>
<li>&#x4F17;&#x591A;&#x8282;&#x70B9;&#x5411;&#x7F51;&#x7EDC;&#x8868;&#x793A;&#x81EA;&#x5DF1;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5728;&#x521B;&#x5EFA;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x88AB;&#x63A5;&#x53D7;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x5F53;&#x4F5C;&#x65B0;&#x533A;&#x5757;&#x4E4B;&#x524D;&#x7684;&#x54C8;&#x5E0C;&#x3002;</li>
</ol>
</blockquote>
<p>Nodes always consider the longest chain to be the correct one and will keep working on extending it. If two nodes broadcast different versions of the next block simultaneously, some nodes may receive one or the other first. In that case, they work on the first one they received, but save the other branch in case it becomes longer. The tie will be broken when the next proof-of-work is found and one branch becomes longer; the nodes that were working on the other branch will then switch to the longer one.</p>
<p>&#x8282;&#x70B9;&#x59CB;&#x7EC8;&#x8BA4;&#x4E3A;&#x6700;&#x957F;&#x94FE;&#x662F;&#x6B63;&#x786E;&#x7684;&#x90A3;&#x4E2A;&#xFF0C;&#x4E14;&#x4F1A;&#x4E0D;&#x65AD;&#x5411;&#x5176;&#x6DFB;&#x52A0;&#x65B0;&#x6570;&#x636E;&#x3002;&#x82E5;&#x662F;&#x6709;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x540C;&#x65F6;&#x5411;&#x7F51;&#x7EDC;&#x5E7F;&#x64AD;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x300C;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x300D;&#xFF0C;&#x6709;&#x4E9B;&#x8282;&#x70B9;&#x4F1A;&#x5148;&#x63A5;&#x6536;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x4F1A;&#x5148;&#x63A5;&#x6536;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8282;&#x70B9;&#x5C06;&#x5728;&#x5B83;&#x4EEC;&#x5148;&#x63A5;&#x6536;&#x5230;&#x7684;&#x90A3;&#x4E2A;&#x533A;&#x5757;&#x4E0A;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x628A;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#xFF0C;&#x4EE5;&#x9632;&#x540E;&#x8005;&#x6210;&#x4E3A;&#x6700;&#x957F;&#x94FE;&#x3002;&#x5F53;&#x4E0B;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x88AB;&#x627E;&#x5230;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x6210;&#x4E3A;&#x66F4;&#x957F;&#x7684;&#x94FE;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6682;&#x65F6;&#x7684;&#x5206;&#x6B67;&#x4F1A;&#x88AB;&#x6253;&#x6D88;&#xFF0C;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x4E0A;&#x5DE5;&#x4F5C;&#x7684;&#x8282;&#x70B9;&#x4EEC;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x66F4;&#x957F;&#x7684;&#x94FE;&#x4E0A;&#x3002;</p>
<p>New transaction broadcasts do not necessarily need to reach all nodes. As long as they reach many nodes, they will get into a block before long. Block broadcasts are also tolerant of dropped messages. If a node does not receive a block, it will request it when it receives the next block and realizes it missed one.</p>
<p>&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x4E0D;&#x89C1;&#x5F97;&#x4E00;&#x5B9A;&#x8981;&#x5E7F;&#x64AD;&#x5230;&#x8FBE;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x3002;&#x53EA;&#x8981;&#x5230;&#x8FBE;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x6CA1;&#x591A;&#x4E45;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x5C31;&#x4F1A;&#x88AB;&#x6253;&#x5305;&#x8FDB;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x3002;&#x533A;&#x5757;&#x5E7F;&#x64AD;&#x4E5F;&#x5BB9;&#x8BB8;&#x4E00;&#x4E9B;&#x6D88;&#x606F;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5E76;&#x672A;&#x63A5;&#x6536;&#x5230;&#x67D0;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x4F1A;&#x5728;&#x5B83;&#x63A5;&#x6536;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65F6;&#x5019;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x9519;&#x5931;&#x4E86;&#x4E4B;&#x524D;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x53D1;&#x51FA;&#x8865;&#x5145;&#x90A3;&#x4E2A;&#x9057;&#x5931;&#x533A;&#x5757;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<h2 id="6-&#x5956;&#x52B1;-incentive"><a name="6-&#x5956;&#x52B1;-incentive" class="anchor-navigation-ex-anchor" href="#6-&#x5956;&#x52B1;-incentive"><i class="fa fa-link" aria-hidden="true"></i></a>6. &#x5956;&#x52B1; (Incentive)</h2>
<p>By convention, the first transaction in a block is a special transaction that starts a new coin owned by the creator of the block. This adds an incentive for nodes to support the network, and provides a way to initially distribute coins into circulation, since there is no central authority to issue them. The steady addition of a constant of amount of new coins is analogous to gold miners expending resources to add gold to circulation. In our case, it is CPU time and electricity that is expended.</p>
<p>&#x6309;&#x7167;&#x7EA6;&#x5B9A;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x7B2C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5B83;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x679A;&#x65B0;&#x7684;&#x786C;&#x5E01;&#xFF0C;&#x6240;&#x5C5E;&#x6743;&#x662F;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x751F;&#x6210;&#x8005;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4F7F;&#x5F97;&#x8282;&#x70B9;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x6709;&#x6240;&#x5956;&#x52B1;&#xFF0C;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5C06;&#x786C;&#x5E01;&#x53D1;&#x884C;&#x5230;&#x6D41;&#x901A;&#x4E4B;&#x4E2D;&#x7684;&#x65B9;&#x5F0F; &#x2014;&#x2014; &#x5728;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x53CD;&#x6B63;&#x4E5F;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6743;&#x5A01;&#x65B9;&#x53BB;&#x53D1;&#x884C;&#x90A3;&#x4E9B;&#x786C;&#x5E01;&#x3002;&#x5982;&#x6B64;&#x8FD9;&#x822C;&#x7A33;&#x5B9A;&#x5730;&#x589E;&#x52A0;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x65B0;&#x786C;&#x5E01;&#x8FDB;&#x5165;&#x6D41;&#x901A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x662F;&#x9EC4;&#x91D1;&#x5F00;&#x91C7;&#x8005;&#x4E0D;&#x65AD;&#x8017;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x8D44;&#x6E90;&#x5F80;&#x6D41;&#x901A;&#x4E4B;&#x4E2D;&#x589E;&#x52A0;&#x9EC4;&#x91D1;&#x4E00;&#x6837;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x88AB;&#x8017;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x662F; CPU &#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x548C;&#x5B83;&#x4EEC;&#x6240;&#x7528;&#x7684;&#x7535;&#x529B;&#x3002;</p>
<p>The incentive can also be funded with transaction fees. If the output value of a transaction is less than its input value, the difference is a transaction fee that is added to the incentive value of the block containing the transaction. Once a predetermined number of coins have entered circulation, the incentive can transition entirely to transaction fees and be completely inflation free.</p>
<p>&#x5956;&#x52B1;&#x8FD8;&#x53EF;&#x4EE5;&#x6765;&#x81EA;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x5982;&#x679C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x503C;&#x5C0F;&#x4E8E;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4E2D;&#x7684;&#x5DEE;&#x989D;&#x5C31;&#x662F;&#x4EA4;&#x6613;&#x8D39;&#xFF1B;&#x800C;&#x8BE5;&#x4EA4;&#x6613;&#x8D39;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5956;&#x52B1;&#x8282;&#x70B9;&#x628A;&#x8BE5;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x8FDB;&#x6B64;&#x533A;&#x5757;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x65E2;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x786C;&#x5E01;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x6D41;&#x901A;&#xFF0C;&#x90A3;&#x4E48;&#x5956;&#x52B1;&#x5C06;&#x5168;&#x9762;&#x4EA4;&#x7531;&#x4EA4;&#x6613;&#x624B;&#x7EED;&#x8D39;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x4E14;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x6709;&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x3002;</p>
<p>The incentive may help encourage nodes to stay honest. If a greedy attacker is able to assemble more CPU power than all the honest nodes, he would have to choose between using it to defraud people by stealing back his payments, or using it to generate new coins. He ought to find it more profitable to play by the rules, such rules that favour him with more new coins than everyone else combined, than to undermine the system and the validity of his own wealth.</p>
<p>&#x5956;&#x52B1;&#x673A;&#x5236;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x9F13;&#x52B1;&#x8282;&#x70B9;&#x4FDD;&#x6301;&#x8BDA;&#x5B9E;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8D2A;&#x5A6A;&#x7684;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x7F51;&#x7F57;&#x6BD4;&#x6240;&#x6709;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x90FD;&#x66F4;&#x591A;&#x7684; CPU &#x7B97;&#x529B;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x662F;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x529B;&#x901A;&#x8FC7;&#x628A;&#x81EA;&#x5DF1;&#x82B1;&#x51FA;&#x53BB;&#x7684;&#x94B1;&#x5077;&#x56DE;&#x6765;&#x53BB;&#x6B3A;&#x9A97;&#x522B;&#x4EBA;&#x5462;&#xFF1F;&#x8FD8;&#x662F;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x529B;&#x53BB;&#x751F;&#x6210;&#x65B0;&#x7684;&#x786C;&#x5E01;&#xFF1F;&#x4ED6;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x6309;&#x7167;&#x89C4;&#x5219;&#x884C;&#x4E8B;&#x662F;&#x66F4;&#x5212;&#x7B97;&#x7684;&#xFF0C;&#x5F53;&#x524D;&#x89C4;&#x5219;&#x4F7F;&#x5F97;&#x4ED6;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x6BD4;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x52A0;&#x8D77;&#x6765;&#x90FD;&#x66F4;&#x591A;&#x7684;&#x786C;&#x5E01;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x6BD4;&#x6697;&#x4E2D;&#x6467;&#x6BC1;&#x7CFB;&#x7EDF;&#x5E76;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x8D22;&#x5BCC;&#x5316;&#x4E3A;&#x865A;&#x65E0;&#x66F4;&#x5212;&#x7B97;&#x3002;</p>
<h2 id="7-&#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;-reclaiming-disk-space"><a name="7-&#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;-reclaiming-disk-space" class="anchor-navigation-ex-anchor" href="#7-&#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;-reclaiming-disk-space"><i class="fa fa-link" aria-hidden="true"></i></a>7. &#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4; (Reclaiming Disk Space)</h2>
<p>Once the latest transaction in a coin is buried under enough blocks, the spent transactions before it can be discarded to save disk space. To facilitate this without breaking the block&apos;s hash, transactions are hashed in a Merkle Tree <sup><a href="#fn_2" id="reffn_2">2</a></sup><sup><a href="#fn_5" id="reffn_5">5</a></sup><sup><a href="#fn_7" id="reffn_7">7</a></sup> , with only the root included in the block&apos;s hash. Old blocks can then be compacted by stubbing off branches of the tree. The interior hashes do not need to be stored.</p>
<p>&#x5982;&#x679C;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x6700;&#x8FD1;&#x53D1;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#x5728;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x533A;&#x5757;&#x4E4B;&#x524D;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x8BE5;&#x786C;&#x5E01;&#x7684;&#x82B1;&#x9500;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x53EF;&#x4EE5;&#x88AB;&#x4E22;&#x5F03; &#x2014;&#x2014; &#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8282;&#x7701;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002;&#x4E3A;&#x4E86;&#x5728;&#x4E0D;&#x7834;&#x574F;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B9E;&#x73B0;&#x6B64;&#x529F;&#x80FD;&#xFF0C;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x7684;&#x54C8;&#x5E0C;&#x5C06;&#x88AB;&#x7EB3;&#x5165;&#x4E00;&#x4E2A; Merkle &#x6811; <sup><a href="#fn_2" id="reffn_2">2</a></sup><sup><a href="#fn_5" id="reffn_5">5</a></sup><sup><a href="#fn_7" id="reffn_7">7</a></sup>&#x4E4B;&#x4E2D;&#xFF0C;&#x800C;&#x53EA;&#x6709;&#x6811;&#x6839;&#x88AB;&#x7EB3;&#x5165;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x4E4B;&#x4E2D;&#x3002;&#x901A;&#x8FC7;&#x780D;&#x6389;&#x6811;&#x679D;&#x65B9;&#x6CD5;&#xFF0C;&#x8001;&#x533A;&#x5757;&#x5373;&#x53EF;&#x88AB;&#x538B;&#x7F29;&#x3002;&#x5185;&#x90E8;&#x7684;&#x54C8;&#x5E0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x4FDD;&#x5B58;&#x3002;</p>
<p><img src="pics/merkle_tree_in_7.svg" alt="merkle_tree_in_7"></p>
<p>A block header with no transactions would be about 80 bytes. If we suppose blocks are generated every 10 minutes, 80 bytes <em> 6 </em> 24 * 365 = 4.2MB per year. With computer systems typically selling with 2GB of RAM as of 2008, and Moore&apos;s Law predicting current growth of 1.2GB per year, storage should not be a problem even if the block headers must be kept in memory.</p>
<p>&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x7684;&#x533A;&#x5757;&#x5934;&#x5927;&#x7EA6;&#x662F; 80 &#x4E2A;&#x5B57;&#x8282;&#x3002;&#x5047;&#x8BBE;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;80 &#x5B57;&#x8282;&#x4E58;&#x4EE5; 6 &#x4E58;&#x4EE5; 24 &#x4E58;&#x4EE5; 365&#xFF0C;&#x7B49;&#x4E8E;&#x6BCF;&#x5E74; 4.2M&#x3002;&#x622A;&#x6B62; 2008 &#x5E74;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5728;&#x552E;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x914D;&#x6709; 2GB &#x5185;&#x5B58;&#xFF0C;&#x800C;&#x6309;&#x7167;&#x6469;&#x5C14;&#x5B9A;&#x5F8B;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x6BCF;&#x5E74;&#x4F1A;&#x589E;&#x52A0; 1.2 GB&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x533A;&#x5757;&#x5934;&#x5FC5;&#x987B;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E4B;&#x4E2D;&#x4E5F;&#x4E0D;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="8-&#x7B80;&#x5316;&#x7248;&#x652F;&#x4ED8;&#x786E;&#x8BA4;-simplified-payment-verification"><a name="8-&#x7B80;&#x5316;&#x7248;&#x652F;&#x4ED8;&#x786E;&#x8BA4;-simplified-payment-verification" class="anchor-navigation-ex-anchor" href="#8-&#x7B80;&#x5316;&#x7248;&#x652F;&#x4ED8;&#x786E;&#x8BA4;-simplified-payment-verification"><i class="fa fa-link" aria-hidden="true"></i></a>8. &#x7B80;&#x5316;&#x7248;&#x652F;&#x4ED8;&#x786E;&#x8BA4; (Simplified Payment Verification)</h2>
<p>It is possible to verify payments without running a full network node. A user only needs to keep a copy of the block headers of the longest proof-of-work chain, which he can get by querying network nodes until he&apos;s convinced he has the longest chain, and obtain the Merkle branch linking the transaction to the block it&apos;s timestamped in. He can&apos;t check the transaction for himself, but by linking it to a place in the chain, he can see that a network node has accepted it, and blocks added after it further confirm the network has accepted it.</p>
<p>&#x5373;&#x4FBF;&#x4E0D;&#x7528;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x786E;&#x8BA4;&#x652F;&#x4ED8;&#x3002;&#x7528;&#x6237;&#x53EA;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4EFD;&#x62E5;&#x6709;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x7684;&#x6700;&#x957F;&#x94FE;&#x7684;&#x533A;&#x5757;&#x5934;&#x62F7;&#x8D1D; &#x2014;&#x2014; &#x4ED6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x5728;&#x7EBF;&#x8282;&#x70B9;&#x786E;&#x8BA4;&#x81EA;&#x5DF1;&#x786E;&#x5B9E;&#x62E5;&#x6709;&#x6700;&#x957F;&#x94FE;&#xFF0C;&#x540C;&#x65F6;&#x83B7;&#x53D6;&#x4E00;&#x6761; Merkle &#x6811;&#x7684;&#x5206;&#x652F; &#x2014;&#x2014; &#x8BE5;&#x5206;&#x652F;&#x5C06;&#x4EA4;&#x6613;&#x548C;&#x300C;&#x5C06;&#x5176;&#x6253;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#x540E;&#x7F6E;&#x5165;&#x300D;&#x7684;&#x533A;&#x5757;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x7528;&#x6237;&#x5E76;&#x4E0D;&#x80FD;&#x81EA;&#x5DF1;&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#xFF0C;&#x4F46;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x4EA4;&#x6613;&#x8FDE;&#x63A5;&#x5230;&#x94FE;&#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x67D0;&#x4E2A;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x63A5;&#x53D7;&#x4E86;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x6B64;&#x540E;&#x52A0;&#x8FDB;&#x6765;&#x7684;&#x533A;&#x5757;&#x8FDB;&#x4E00;&#x6B65;&#x786E;&#x8BA4;&#x4E86;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x63A5;&#x53D7;&#x4E86;&#x6B64;&#x7B14;&#x4EA4;&#x6613;&#x3002;</p>
<p><img src="pics/merkle_tree.svg" alt="merkle tree"></p>
<p>As such, the verification is reliable as long as honest nodes control the network, but is more vulnerable if the network is overpowered by an attacker. While network nodes can verify transactions for themselves, the simplified method can be fooled by an attacker&apos;s fabricated transactions for as long as the attacker can continue to overpower the network. One strategy to protect against this would be to accept alerts from network nodes when they detect an invalid block, prompting the user&apos;s software to download the full block and alerted transactions to confirm the inconsistency. Businesses that receive frequent payments will probably still want to run their own nodes for more independent security and quicker verification.</p>
<p>&#x53EA;&#x8981;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x4F9D;&#x7136;&#x5728;&#x638C;&#x63A7;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x6B64;&#x8FD9;&#x822C;&#xFF0C;&#x9A8C;&#x8BC1;&#x5373;&#x4E3A;&#x53EF;&#x9760;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x88AB;&#x653B;&#x51FB;&#x8005;&#x6240;&#x63A7;&#x5236;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9A8C;&#x8BC1;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x53EF;&#x9760;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x7EE7;&#x7EED;&#x63A7;&#x5236;&#x7F51;&#x7EDC;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x7B80;&#x5316;&#x7248;&#x9A8C;&#x8BC1;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x653B;&#x51FB;&#x8005;&#x4F2A;&#x9020;&#x7684;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x6240;&#x6B3A;&#x9A97;&#x3002;&#x5E94;&#x5BF9;&#x7B56;&#x7565;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x8981;&#x63A5;&#x53D7;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x7684;&#x8B66;&#x544A;&#x3002;&#x5F53;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x53D1;&#x73B0;&#x65E0;&#x6548;&#x533A;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5373;&#x53D1;&#x51FA;&#x8B66;&#x62A5;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x7684;&#x8F6F;&#x4EF6;&#x4E0A;&#x5F39;&#x51FA;&#x901A;&#x77E5;&#xFF0C;&#x544A;&#x77E5;&#x7528;&#x6237;&#x4E0B;&#x8F7D;&#x5B8C;&#x6574;&#x533A;&#x5757;&#xFF0C;&#x8B66;&#x544A;&#x7528;&#x6237;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x90A3;&#x4E9B;&#x6709;&#x9AD8;&#x9891;&#x6536;&#x4ED8;&#x53D1;&#x751F;&#x7684;&#x5546;&#x5BB6;&#x5E94;&#x8BE5;&#x4ECD;&#x7136;&#x5E0C;&#x671B;&#x8FD0;&#x884C;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x6B64;&#x4FDD;&#x8BC1;&#x66F4;&#x72EC;&#x7ACB;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x66F4;&#x5FEB;&#x7684;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x3002;</p>
<h2 id="9-&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;-combining-and-splitting-value"><a name="9-&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;-combining-and-splitting-value" class="anchor-navigation-ex-anchor" href="#9-&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;-combining-and-splitting-value"><i class="fa fa-link" aria-hidden="true"></i></a>9. &#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272; (Combining and Splitting Value)</h2>
<p>Although it would be possible to handle coins individually, it would be unwieldy to make a separate transaction for every cent in a transfer. To allow value to be split and combined, transactions contain multiple inputs and outputs. Normally there will be either a single input from a larger previous transaction or multiple inputs combining smaller amounts, and at most two outputs: one for the payment, and one returning the change, if any, back to the sender.</p>
<p>&#x5C3D;&#x7BA1;&#x9010;&#x4E2A;&#x5730;&#x5904;&#x7406;&#x786C;&#x5E01;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x4E3A;&#x6BCF;&#x5206;&#x94B1;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x8BB0;&#x5F55;&#x662F;&#x5F88;&#x7B28;&#x62D9;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x5141;&#x8BB8;&#x503C;&#x7684;&#x5206;&#x5272;&#x4E0E;&#x5408;&#x5E76;&#xFF0C;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x5927;&#x7684;&#x4E4B;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x5F88;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x4E8E;&#x66F4;&#x5C0F;&#x91D1;&#x989D;&#x7684;&#x7EC4;&#x5408;&#xFF1B;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6700;&#x591A;&#x6709;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x652F;&#x4ED8;&#xFF08;&#x6307;&#x5411;&#x6536;&#x6B3E;&#x65B9;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x5FC5;&#x8981;&#x7684;&#x8BDD;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x627E;&#x96F6;&#xFF08;&#x6307;&#x5411;&#x53D1;&#x6B3E;&#x65B9;&#xFF09;&#x3002;</p>
<p><img src="pics/tx_ios.svg" alt="tx_ios"></p>
<p>It should be noted that fan-out, where a transaction depends on several transactions, and those transactions depend on many more, is not a problem here. There is never the need to extract a complete standalone copy of a transaction&apos;s history.</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x201C;&#x6247;&#x51FA;&#x201D;&#x5728;&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x662F;&#x95EE;&#x9898; &#x2014;&#x2014; &#x6240;&#x8C13;&#x201C;&#x6247;&#x51FA;&#x201D;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x4F9D;&#x8D56;&#x4E8E;&#x6570;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x4E14;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x53C8;&#x4F9D;&#x8D56;&#x4E8E;&#x66F4;&#x591A;&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x53BB;&#x63D0;&#x53D6;&#x4EFB;&#x4F55;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5B8C;&#x6574;&#x72EC;&#x7ACB;&#x7684;&#x5386;&#x53F2;&#x62F7;&#x8D1D;&#x3002;</p>
<h2 id="10-&#x9690;&#x79C1;-privacy"><a name="10-&#x9690;&#x79C1;-privacy" class="anchor-navigation-ex-anchor" href="#10-&#x9690;&#x79C1;-privacy"><i class="fa fa-link" aria-hidden="true"></i></a>10. &#x9690;&#x79C1; (Privacy)</h2>
<p>The traditional banking model achieves a level of privacy by limiting access to information to the parties involved and the trusted third party. The necessity to announce all transactions publicly precludes this method, but privacy can still be maintained by breaking the flow of information in another place: by keeping public keys anonymous. The public can see that someone is sending an amount to someone else, but without information linking the transaction to anyone. This is similar to the level of information released by stock exchanges, where the time and size of individual trades, the &quot;tape&quot;, is made public, but without telling who the parties were.</p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x94F6;&#x884C;&#x6A21;&#x578B;&#x901A;&#x8FC7;&#x9650;&#x5236;&#x4ED6;&#x4EBA;&#x83B7;&#x53D6;&#x4EA4;&#x6613;&#x8005;&#x548C;&#x53EF;&#x4FE1;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x4FE1;&#x606F;&#x800C;&#x8FBE;&#x6210;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x3002;&#x51FA;&#x4E8E;&#x5BF9;&#x5C06;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x516C;&#x5F00;&#x7684;&#x9700;&#x6C42;&#x5426;&#x51B3;&#x4E86;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x7EF4;&#x6301;&#x9690;&#x79C1;&#x53EF;&#x901A;&#x8FC7;&#x4E8E;&#x53E6;&#x4E00;&#x5904;&#x7684;&#x5207;&#x65AD;&#x4FE1;&#x606F;&#x6D41;&#x6765;&#x5B9E;&#x73B0;&#x2014;&#x2014;&#x516C;&#x94A5;&#x533F;&#x540D;&#x3002;&#x516C;&#x4F17;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x67D0;&#x4E2A;&#x5730;&#x5740;&#x5411;&#x67D0;&#x4E2A;&#x5730;&#x5740;&#x8F6C;&#x4E86;&#x4E00;&#x7B14;&#x94B1;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x6307;&#x5411;&#x67D0;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x79CD;&#x6C34;&#x5E73;&#x7684;&#x4FE1;&#x606F;&#x53D1;&#x5E03;&#x6709;&#x70B9;&#x50CF;&#x80A1;&#x5E02;&#x4EA4;&#x6613;&#xFF0C;&#x53EA;&#x6709;&#x65F6;&#x95F4;&#x548C;&#x5404;&#x4E2A;&#x4EA4;&#x6613;&#x7684;&#x91D1;&#x989D;&#x88AB;&#x516C;&#x5E03;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x4EA4;&#x6613;&#x53CC;&#x65B9;&#x90FD;&#x662F;&#x8C01;&#x3002;</p>
<p><img src="pics/privacy.svg" alt="Privacy"></p>
<p>As an additional firewall, a new key pair should be used for each transaction to keep them from being linked to a common owner. Some linking is still unavoidable with multi-input transactions, which necessarily reveal that their inputs were owned by the same owner. The risk is that if the owner of a key is revealed, linking could reveal other transactions that belonged to the same owner.</p>
<p>&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x5C42;&#x9632;&#x706B;&#x5899;&#x3002;&#x4EA4;&#x6613;&#x8005;&#x5E94;&#x8BE5;&#x9488;&#x5BF9;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x542F;&#x7528;&#x4E00;&#x5BF9;&#x65B0;&#x7684;&#x516C;&#x79C1;&#x94A5;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ED6;&#x4EBA;&#x65E0;&#x6CD5;&#x5C06;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x8FFD;&#x6EAF;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x8005;&#x8EAB;&#x4E0A;&#x3002;&#x6709;&#x4E9B;&#x591A;&#x8F93;&#x5165;&#x7684;&#x4EA4;&#x6613;&#x4F9D;&#x7136;&#x96BE;&#x514D;&#x88AB;&#x8FFD;&#x6EAF;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x4E9B;&#x8F93;&#x5165;&#x5FC5;&#x7136;&#x4F1A;&#x88AB;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#x81EA;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x8005;&#x3002;&#x5371;&#x9669;&#x5728;&#x4E8E;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x7684;&#x6240;&#x6709;&#x8005;&#x88AB;&#x66DD;&#x5149;&#x4E4B;&#x540E;&#xFF0C;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x4EA4;&#x6613;&#x90FD;&#x4F1A;&#x88AB;&#x66DD;&#x5149;&#x3002;</p>
<h2 id="11-&#x8BA1;&#x7B97;-calculations"><a name="11-&#x8BA1;&#x7B97;-calculations" class="anchor-navigation-ex-anchor" href="#11-&#x8BA1;&#x7B97;-calculations"><i class="fa fa-link" aria-hidden="true"></i></a>11. &#x8BA1;&#x7B97; (Calculations)</h2>
<p>We consider the scenario of an attacker trying to generate an alternate chain faster than the honest chain. Even if this is accomplished, it does not throw the system open to arbitrary changes, such as creating value out of thin air or taking money that never belonged to the attacker. Nodes are not going to accept an invalid transaction as payment, and honest nodes will never accept a block containing them. An attacker can only try to change one of his own transactions to take back money he recently spent.</p>
<p>&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x67D0;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x6B63;&#x5728;&#x8BD5;&#x56FE;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6BD4;&#x8BDA;&#x5B9E;&#x94FE;&#x66F4;&#x5FEB;&#x7684;&#x66FF;&#x4EE3;&#x94FE;&#x3002;&#x5C31;&#x7B97;&#x4ED6;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4F7F;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x88AB;&#x4EFB;&#x610F;&#x63A7;&#x5236;&#xFF0C;&#x5373;&#xFF0C;&#x4ED6;&#x4E0D;&#x53EF;&#x80FD;&#x51ED;&#x7A7A;&#x5236;&#x9020;&#x51FA;&#x4EF7;&#x503C;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x4ECE;&#x672A;&#x5C5E;&#x4E8E;&#x4ED6;&#x7684;&#x94B1;&#x3002;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x4E0D;&#x4F1A;&#x628A;&#x4E00;&#x7B14;&#x65E0;&#x6548;&#x4EA4;&#x6613;&#x5F53;&#x4F5C;&#x652F;&#x4ED8;&#xFF0C;&#x800C;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x4E5F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x8FD9;&#x79CD;&#x652F;&#x4ED8;&#x7684;&#x533A;&#x5757;&#x3002;&#x653B;&#x51FB;&#x8005;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x4FEE;&#x6539;&#x5C5E;&#x4E8E;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x8FDB;&#x800C;&#x8BD5;&#x56FE;&#x53D6;&#x56DE;&#x4ED6;&#x5DF2;&#x7ECF;&#x82B1;&#x51FA;&#x53BB;&#x7684;&#x94B1;<strong>&#xFF08;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#xFF09;</strong>&#x3002;</p>
<p>The race between the honest chain and an attacker chain can be characterized as a Binomial Random Walk. The success event is the honest chain being extended by one block, increasing its lead by +1, and the failure event is the attacker&apos;s chain being extended by one block, reducing the gap by -1.</p>
<p>&#x8BDA;&#x5B9E;&#x94FE;&#x548C;&#x653B;&#x51FB;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x7ADE;&#x4E89;&#x53EF;&#x4EE5;&#x7528;&#x4E8C;&#x9879;&#x968F;&#x673A;&#x6F2B;&#x6B65;&#x6765;&#x63CF;&#x8FF0;&#x3002;&#x6210;&#x529F;&#x4E8B;&#x4EF6;&#x662F;&#x8BDA;&#x5B9E;&#x94FE;&#x521A;&#x521A;&#x88AB;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x7684;&#x4F18;&#x52BF;&#x589E;&#x52A0;&#x4E86; 1&#xFF1B;&#x800C;&#x5931;&#x8D25;&#x4E8B;&#x4EF6;&#x662F;&#x653B;&#x51FB;&#x8005;&#x7684;&#x94FE;&#x521A;&#x521A;&#x88AB;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x4F7F;&#x5F97;&#x8BDA;&#x5B9E;&#x94FE;&#x7684;&#x4F18;&#x52BF;&#x51CF;&#x5C11;&#x4E86; 1&#x3002;</p>
<p>The probability of an attacker catching up from a given deficit is analogous to a Gambler&apos;s Ruin problem. Suppose a gambler with unlimited credit starts at a deficit and plays potentially an infinite number of trials to try to reach breakeven. We can calculate the probability he ever reaches breakeven, or that an attacker ever catches up with the honest chain, as follows<sup><a href="#fn_8" id="reffn_8">8</a></sup>:</p>
<p>&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x4ECE;&#x843D;&#x540E;&#x5C40;&#x9762;&#x8FFD;&#x5E73;&#x7684;&#x6982;&#x7387;&#x7C7B;&#x4F3C;&#x4E8E;&#x8D4C;&#x5F92;&#x7834;&#x4EA7;&#x95EE;&#x9898;&#x3002;&#x5047;&#x8BBE;&#xFF0C;&#x4E00;&#x4E2A;&#x62FF;&#x7740;&#x65E0;&#x9650;&#x7B79;&#x7801;&#x7684;&#x8D4C;&#x5F92;&#xFF0C;&#x4ECE;&#x4E8F;&#x7A7A;&#x5F00;&#x59CB;&#xFF0C;&#x5141;&#x8BB8;&#x4ED6;&#x8D4C;&#x65E0;&#x9650;&#x6B21;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x586B;&#x8865;&#x4E0A;&#x5DF2;&#x6709;&#x7684;&#x4E8F;&#x7A7A;&#x3002;&#x6211;&#x4EEC;&#x80FD;&#x7B97;&#x51FA;&#x4ED6;&#x6700;&#x7EC8;&#x80FD;&#x586B;&#x8865;&#x4E8F;&#x7A7A;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x8D76;&#x4E0A;&#x8BDA;&#x5B9E;&#x94FE;&#x7684;&#x6982;&#x7387;<sup><a href="#fn_8" id="reffn_8">8</a></sup>&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$ \begin{eqnarray<em>} \large p &amp;=&amp; \text{ &#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x627E;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6982;&#x7387;}\\ \large q &amp;=&amp; \text{ &#x653B;&#x51FB;&#x8005;&#x627E;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6982;&#x7387;}\ \\large q_z &amp;=&amp; \text{ &#x653B;&#x51FB;&#x8005;&#x843D;&#x540E; $z$ &#x4E2A;&#x533A;&#x5757;&#x5374;&#x4F9D;&#x7136;&#x80FD;&#x591F;&#x8D76;&#x4E0A;&#x7684;&#x6982;&#x7387;} \end{eqnarray</em>} $$</p>
<p>$$ \large q_z = \begin{Bmatrix} 1 &amp; \textit{if } p \leq q\ \\ (q/p)^z &amp; \textit{if } p &gt; q \end{Bmatrix} $$</p>
<p>Given our assumption that  p &gt; q , the probability drops exponentially as the number of blocks the attacker has to catch up with increases. With the odds against him, if he doesn&apos;t make a lucky lunge forward early on, his chances become vanishingly small as he falls further behind.</p>
<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5047;&#x5B9A; p &gt; q&#x200B;, &#x65E2;&#x7136;&#x653B;&#x51FB;&#x8005;&#x9700;&#x8981;&#x8D76;&#x8D85;&#x7684;&#x533A;&#x5757;&#x6570;&#x91CF;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x6210;&#x529F;&#x6982;&#x7387;&#x5C31;&#x4F1A;&#x6307;&#x6570;&#x7EA7;&#x4E0B;&#x964D;&#x3002;&#x4E8E;&#x8D62;&#x9762;&#x4E0D;&#x5229;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x6CA1;&#x6709;&#x5728;&#x8D77;&#x521D;&#x5C31;&#x80FD;&#x5E78;&#x8FD0;&#x5730;&#x505A;&#x4E00;&#x4E2A;&#x524D;&#x79FB;&#x6B65;&#x523A;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x7684;&#x80DC;&#x7387;&#x5C06;&#x5728;&#x4ED6;&#x8FDB;&#x4E00;&#x6B65;&#x843D;&#x540E;&#x7684;&#x540C;&#x65F6;&#x6D88;&#x5F2D;&#x6B86;&#x5C3D;&#x3002;</p>
<p>We now consider how long the recipient of a new transaction needs to wait before being sufficiently certain the sender can&apos;t change the transaction. We assume the sender is an attacker who wants to make the recipient believe he paid him for a while, then switch it to pay back to himself after some time has passed. The receiver will be alerted when that happens, but the sender hopes it will be too late.</p>
<p>&#x73B0;&#x5728;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x4E00;&#x7B14;&#x65B0;&#x4EA4;&#x6613;&#x7684;&#x6536;&#x6B3E;&#x4EBA;&#x9700;&#x8981;&#x7B49;&#x591A;&#x4E45;&#x624D;&#x80FD;&#x5145;&#x5206;&#x786E;&#x5B9A;&#x53D1;&#x6B3E;&#x4EBA;&#x4E0D;&#x80FD;&#x66F4;&#x6539;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x53D1;&#x6B3E;&#x4EBA;&#x662F;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#xFF0C;&#x5984;&#x56FE;&#x8BA9;&#x6536;&#x6B3E;&#x4EBA;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#x76F8;&#x4FE1;&#x4ED6;&#x5DF2;&#x7ECF;&#x652F;&#x4ED8;&#x5BF9;&#x4ED8;&#x6B3E;&#x9879;&#xFF0C;&#x968F;&#x540E;&#x5C06;&#x8FD9;&#x7B14;&#x94B1;&#x518D;&#x8F6C;&#x56DE;&#x7ED9;&#x81EA;&#x5DF1;&#x3002;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x6536;&#x6B3E;&#x4EBA;&#x5F53;&#x7136;&#x4F1A;&#x6536;&#x5230;&#x8B66;&#x544A;&#xFF0C;&#x4F46;&#x53D1;&#x6B3E;&#x4EBA;&#x5E0C;&#x671B;&#x90A3;&#x65F6;&#x6728;&#x5DF2;&#x6210;&#x821F;&#x3002;</p>
<p>The receiver generates a new key pair and gives the public key to the sender shortly before signing. This prevents the sender from preparing a chain of blocks ahead of time by working on it continuously until he is lucky enough to get far enough ahead, then executing the transaction at that moment. Once the transaction is sent, the dishonest sender starts working in secret on a parallel chain containing an alternate version of his transaction.</p>
<p>&#x6536;&#x6B3E;&#x4EBA;&#x751F;&#x6210;&#x4E86;&#x4E00;&#x5BF9;&#x65B0;&#x7684;&#x516C;&#x79C1;&#x94A5;&#xFF0C;&#x800C;&#x540E;&#x5728;&#x7B7E;&#x7F72;&#x4E4B;&#x524D;&#x4E0D;&#x4E45;&#x5C06;&#x516C;&#x94A5;&#x544A;&#x77E5;&#x53D1;&#x6B3E;&#x4EBA;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x4E00;&#x79CD;&#x60C5;&#x5F62;&#xFF1A;&#x53D1;&#x6B3E;&#x4EBA;&#x63D0;&#x524D;&#x901A;&#x8FC7;&#x8FDE;&#x7EED;&#x8FD0;&#x7B97;&#x53BB;&#x51C6;&#x5907;&#x4E00;&#x6761;&#x94FE;&#x4E0A;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8FD0;&#x6C14;&#x5C31;&#x4F1A;&#x8DB3;&#x591F;&#x9886;&#x5148;&#xFF0C;&#x76F4;&#x5230;&#x90A3;&#x65F6;&#x518D;&#x6267;&#x884C;&#x4EA4;&#x6613;&#x3002;&#x4E00;&#x65E6;&#x6B3E;&#x9879;&#x5DF2;&#x88AB;&#x53D1;&#x51FA;&#xFF0C;&#x90A3;&#x4E2A;&#x4E0D;&#x8BDA;&#x5B9E;&#x7684;&#x53D1;&#x6B3E;&#x4EBA;&#x5F00;&#x59CB;&#x79D8;&#x5BC6;&#x5730;&#x5728;&#x53E6;&#x4E00;&#x6761;&#x5E73;&#x884C;&#x94FE;&#x4E0A;&#x5F00;&#x5DE5;&#xFF0C;&#x8BD5;&#x56FE;&#x5728;&#x5176;&#x4E2D;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x53CD;&#x5411;&#x7248;&#x672C;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p>The recipient waits until the transaction has been added to a block and z&#x200B; blocks have been linked after it. He doesn&apos;t know the exact amount of progress the attacker has made, but assuming the honest blocks took the average expected time per block, the attacker&apos;s potential progress will be a Poisson distribution with expected value:</p>
<p>&#x6536;&#x6B3E;&#x4EBA;&#x7B49;&#x5230;&#x6B64;&#x7B14;&#x4EA4;&#x6613;&#x88AB;&#x6253;&#x5305;&#x8FDB;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x5DF2;&#x7ECF;&#x6709; z&#x200B; &#x4E2A;&#x533A;&#x5757;&#x968F;&#x540E;&#x88AB;&#x52A0;&#x5165;&#x3002;&#x4ED6;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x653B;&#x51FB;&#x8005;&#x7684;&#x5DE5;&#x4F5C;&#x8FDB;&#x5C55;&#x7A76;&#x7ADF;&#x5982;&#x4F55;&#xFF0C;&#x4F46;&#x662F;&#x5047;&#x5B9A;&#x8BDA;&#x5B9E;&#x533A;&#x5757;&#x6309;&#x7167;&#x671F;&#x671B;&#x7684;&#x5E73;&#x5747;&#x901F;&#x5EA6;&#x751F;&#x6210;&#xFF0C;&#x5219;&#x653B;&#x51FB;&#x8005;&#x7684;&#x6F5C;&#x5728;&#x8FDB;&#x5C55;&#x7B26;&#x5408;&#x6CCA;&#x677E;&#x5206;&#x5E03;&#xFF0C;&#x5176;&#x671F;&#x671B;&#x503C;&#x4E3A;&#xFF1A;</p>
<p>$$ \large \lambda = z \frac qp $$</p>
<p>To get the probability the attacker could still catch up now, we multiply the Poisson density for each amount of progress he could have made by the probability he could catch up from that point:</p>
<p>&#x4E3A;&#x4E86;&#x7B97;&#x51FA;&#x653B;&#x51FB;&#x8005;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x8D76;&#x4E0A;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x5DF2;&#x6709;&#x7684;&#x8FDB;&#x5C55;&#x7684;&#x6CCA;&#x677E;&#x5BC6;&#x5EA6;&#xFF0C;&#x4E58;&#x4EE5;&#x4ED6;&#x53EF;&#x4EE5;&#x4ECE;&#x90A3;&#x4E00;&#x70B9;&#x80FD;&#x591F;&#x8FFD;&#x4E0A;&#x6765;&#x7684;&#x6982;&#x7387;&#xFF1A;</p>
<p>$$ \large \sum_{k=0}^{\infty} \frac{\lambda^k e^{-\lambda}}{k!} \cdot \begin{Bmatrix} (q/p)^{(z-k)} &amp; \textit{if } k\leq z\ \\ 1 &amp; \textit{if } k &gt; z \end{Bmatrix} $$</p>
<p><img src="pics/attack_probability.jpg" alt="attack_probability"></p>
<p>Rearranging to avoid summing the infinite tail of the distribution...</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5BF9;&#x5BC6;&#x5EA6;&#x5206;&#x5E03;&#x7684;&#x65E0;&#x7A77;&#x7EA7;&#x6570;&#x6C42;&#x548C;&#x91CD;&#x65B0;&#x6574;&#x7406;&#x2026;</p>
<p>$$ \large 1 - \sum_{k=0}^{z} \frac{\lambda^k e^{-\lambda}}{k!} \left ( 1-(q/p)^{(z-k)} \right ) $$</p>
<p>Converting to C code...</p>
<p>&#x8F6C;&#x6362;&#x4E3A; C &#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x2026;&#x2026;</p>
<pre class="language-"><code>#include <span class="token tag"><span class="token tag"><span class="token punctuation">&lt;</span>math.h</span><span class="token punctuation">&gt;</span></span>
double AttackerSuccessProbability(double q, int z)
{
    double p = 1.0 - q;
    double lambda = z * (q / p);
    double sum = 1.0;
    int i, k;
    for (k = 0; k &lt;= z; k++)
    {
        double poisson = exp(-lambda);
        for (i = 1; i &lt;= k; i++)
            poisson *= lambda / i;
        sum -= poisson * (1 - pow(q / p, z - k));
    }
    return sum;
}
</code></pre><p>Running some results, we can see the probability drop off exponentially with z&#x200B;.</p>
<p>&#x83B7;&#x53D6;&#x90E8;&#x5206;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6982;&#x7387;&#x968F;&#x7740; z&#x200B; &#x7684;&#x589E;&#x52A0;&#x6307;&#x6570;&#x7EA7;&#x4E0B;&#x964D;&#xFF1A;</p>
<pre class="language-"><code>   q=0.1
   z=0    P=1.0000000
   z=1    P=0.2045873
   z=2    P=0.0509779
   z=3    P=0.0131722
   z=4    P=0.0034552
   z=5    P=0.0009137
   z=6    P=0.0002428
   z=7    P=0.0000647
   z=8    P=0.0000173
   z=9    P=0.0000046
   z=10   P=0.0000012

   q=0.3
   z=0    P=1.0000000
   z=5    P=0.1773523
   z=10   P=0.0416605
   z=15   P=0.0101008
   z=20   P=0.0024804
   z=25   P=0.0006132
   z=30   P=0.0001522
   z=35   P=0.0000379
   z=40   P=0.0000095
   z=45   P=0.0000024
   z=50   P=0.0000006
</code></pre><p>Solving for P less than 0.1%...</p>
<p>&#x82E5;&#x662F; P &#x5C0F;&#x4E8E; 0.1%&#x2026;&#x2026;</p>
<pre class="language-"><code>   P &lt; 0.001
   q=0.10   z=5
   q=0.15   z=8
   q=0.20   z=11
   q=0.25   z=15
   q=0.30   z=24
   q=0.35   z=41
   q=0.40   z=89
   q=0.45   z=340
</code></pre><h2 id="12-&#x7ED3;&#x8BBA;-conclusion"><a name="12-&#x7ED3;&#x8BBA;-conclusion" class="anchor-navigation-ex-anchor" href="#12-&#x7ED3;&#x8BBA;-conclusion"><i class="fa fa-link" aria-hidden="true"></i></a>12. &#x7ED3;&#x8BBA; (Conclusion)</h2>
<p>We have proposed a system for electronic transactions without relying on trust. We started with the usual framework of coins made from digital signatures, which provides strong control of ownership, but is incomplete without a way to prevent double-spending. To solve this, we proposed a peer-to-peer network using proof-of-work to record a public history of transactions that quickly becomes computationally impractical for an attacker to change if honest nodes control a majority of CPU power. The network is robust in its unstructured simplicity. Nodes work all at once with little coordination. They do not need to be identified, since messages are not routed to any particular place and only need to be delivered on a best effort basis. Nodes can leave and rejoin the network at will, accepting the proof-of-work chain as proof of what happened while they were gone. They vote with their CPU power, expressing their acceptance of valid blocks by working on extending them and rejecting invalid blocks by refusing to work on them. Any needed rules and incentives can be enforced with this consensus mechanism.</p>
<p>&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x5FC5;&#x4F9D;&#x8D56;&#x4FE1;&#x4EFB;&#x7684;&#x7535;&#x5B50;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x3002;&#x8D77;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x786C;&#x5E01;&#x6846;&#x67B6;&#x5F00;&#x59CB;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x5065;&#x58EE;&#x7684;&#x6240;&#x6709;&#x6743;&#x63A7;&#x5236;&#xFF0C;&#x5374;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x53BB;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x516C;&#x5F00;&#x7684;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x5386;&#x53F2;&#xFF0C;&#x53EA;&#x8981;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x63A7;&#x5236;&#x5927;&#x591A;&#x6570; CPU &#x7B97;&#x529B;&#xFF0C;&#x90A3;&#x4E48;&#x653B;&#x51FB;&#x8005;&#x5C31;&#x4EC5;&#x4ECE;&#x7B97;&#x529B;&#x65B9;&#x9762;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x6210;&#x529F;&#x7BE1;&#x6539;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5065;&#x58EE;&#x5728;&#x4E8E;&#x5B83;&#x7684;&#x65E0;&#x7ED3;&#x6784;&#x7684;&#x7B80;&#x5355;&#x3002;&#x8282;&#x70B9;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5F88;&#x5C11;&#x534F;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x77AC;&#x95F4;&#x540C;&#x65F6;&#x5DE5;&#x4F5C;&#x3002;&#x5B83;&#x4EEC;&#x751A;&#x81F3;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x8FA8;&#x8BA4;&#xFF0C;&#x56E0;&#x4E3A;&#x6D88;&#x606F;&#x7684;&#x8DEF;&#x5F84;&#x5E76;&#x975E;&#x53D6;&#x51B3;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x7EC8;&#x70B9;&#xFF1B;&#x6D88;&#x606F;&#x53EA;&#x9700;&#x8981;&#x88AB;&#x4EE5;&#x6700;&#x5927;&#x52AA;&#x529B;&#x4E3A;&#x57FA;&#x672C;&#x53BB;&#x4F20;&#x64AD;&#x5373;&#x53EF;&#x3002;&#x8282;&#x70B9;&#x6765;&#x53BB;&#x81EA;&#x7531;&#xFF0C;&#x91CD;&#x65B0;&#x52A0;&#x5165;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x94FE;&#xFF0C;&#x4F5C;&#x4E3A;&#x5B83;&#x4EEC;&#x79BB;&#x7EBF;&#x4E4B;&#x65F6;&#x6240;&#x53D1;&#x751F;&#x4E4B;&#x4E00;&#x5207;&#x7684;&#x8BC1;&#x660E;&#x3002;&#x5B83;&#x4EEC;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x7684; CPU &#x7B97;&#x529B;&#x6295;&#x7968;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x4E3A;&#x94FE;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x6709;&#x6548;&#x533A;&#x5757;&#x3001;&#x62D2;&#x7EDD;&#x65E0;&#x6548;&#x533A;&#x5757;&#xFF0C;&#x53BB;&#x8868;&#x793A;&#x5B83;&#x4EEC;&#x5BF9;&#x6709;&#x6548;&#x4EA4;&#x6613;&#x7684;&#x63A5;&#x53D7;&#x4E0E;&#x5426;&#x3002;&#x4EFB;&#x4F55;&#x5FC5;&#x8981;&#x7684;&#x89C4;&#x5219;&#x548C;&#x5956;&#x52B1;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x6765;&#x5F3A;&#x5236;&#x5B9E;&#x65BD;&#x3002;</p>
<blockquote id="fn_1">
<sup>1</sup>. <strong>b-money</strong> Dai Wei (1998-11-01) <a href="http://www.weidai.com/bmoney.txt" target="_blank">http://www.weidai.com/bmoney.txt</a><a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_2">
<sup>2</sup>. <strong>Design of a secure timestamping service with minimal trust requirements</strong> Henri Massias, Xavier Serret-Avila, Jean-Jacques Quisquater <em>20th Symposium on Information Theory in the Benelux</em> (1999-05) <a href="http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.13.6228" target="_blank">http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.13.6228</a><a href="#reffn_2" title="Jump back to footnote [2] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_3">
<sup>3</sup>. <strong>How to time-stamp a digital document</strong> Stuart Haber, W.Scott Stornetta <em>Journal of Cryptology</em> (1991) <a href="https://doi.org/cwwxd4" target="_blank">https://doi.org/cwwxd4</a> DOI: <a href="https://doi.org/10.1007/bf00196791" target="_blank">10.1007/bf00196791</a><a href="#reffn_3" title="Jump back to footnote [3] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_4">
<sup>4</sup>. <strong>Improving the Efficiency and Reliability of Digital Time-Stamping</strong> Dave Bayer, Stuart Haber, W. Scott Stornetta <em>Sequences II</em> (1993) <a href="https://doi.org/bn4rpx" target="_blank">https://doi.org/bn4rpx</a> DOI: <a href="https://doi.org/10.1007/978-1-4613-9323-8_24" target="_blank">10.1007/978-1-4613-9323-8_24</a><a href="#reffn_4" title="Jump back to footnote [4] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_5">
<sup>5</sup>. <strong>Secure names for bit-strings</strong> Stuart Haber, W. Scott Stornetta <em>Proceedings of the 4th ACM conference on Computer and communications security - CCS &#x2019;97</em>(1997) <a href="https://doi.org/dtnrf6" target="_blank">https://doi.org/dtnrf6</a> DOI: <a href="https://doi.org/10.1145/266420.266430" target="_blank">10.1145/266420.266430</a><a href="#reffn_5" title="Jump back to footnote [5] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_6">
<sup>6</sup>. <strong>Hashcash - A Denial of Service Counter-Measure</strong> Adam Back (2002-08-01) <a href="http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.15.8" target="_blank">http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.15.8</a><a href="#reffn_6" title="Jump back to footnote [6] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_7">
<sup>7</sup>. <strong>Protocols for Public Key Cryptosystems</strong> Ralph C. Merkle <em>1980 IEEE Symposium on Security and Privacy</em> (1980-04) <a href="https://doi.org/bmvbd6" target="_blank">https://doi.org/bmvbd6</a> DOI: <a href="https://doi.org/10.1109/sp.1980.10006" target="_blank">10.1109/sp.1980.10006</a><a href="#reffn_7" title="Jump back to footnote [7] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_8">
<sup>8</sup>. <strong>An Introduction to Probability Theory and its Applications</strong> William Feller <em>John Wiley &amp; Sons</em> (1957) <a href="https://archive.org/details/AnIntroductionToProbabilityTheoryAndItsApplicationsVolume1" target="_blank">https://archive.org/details/AnIntroductionToProbabilityTheoryAndItsApplicationsVolume1</a> <a href="#reffn_8" title="Jump back to footnote [8] in the text."> &#x21A9;</a>
</blockquote>
<footer class="page-footer"><span class="copyright">&#x674E;&#x5927;&#x72D7; Leeduckgo &#xA9; 2019  all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Last Modified: 
2019-09-15
</span></footer> <link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"> <script>     window.klipse_settings = {         selector: ".language-klipse, .lang-eval-clojure",         selector_eval_js: ".lang-eval-js",         selector_eval_python_client: ".lang-eval-python",         selector_eval_php: ".lang-eval-php",         selector_eval_scheme: ".lang-eval-scheme",         selector_eval_ruby: ".lang-eval-ruby",         selector_reagent: ".lang-reagent",        selector_google_charts: ".lang-google-chart",        selector_es2017: ".lang-eval-es2017",        selector_jsx: ".lang-eval-jsx",        selector_transpile_jsx: ".lang-transpile-jsx",        selector_render_jsx: ".lang-render-jsx",        selector_react: ".lang-react",        selector_eval_markdown: ".lang-render-markdown",        selector_eval_lambdaway: ".lang-render-lambdaway",        selector_eval_cpp: ".lang-eval-cpp",        selector_eval_html: ".lang-render-html",        selector_sql: ".lang-eval-sql",        selector_brainfuck: "lang-eval-brainfuck",        selector_js: ".lang-transpile-cljs"    }; </script> <script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="bitcoin_whitepaper_en.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 英文版">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"中文版","level":"1.1","depth":1,"next":{"title":"英文版","level":"1.2","depth":1,"path":"bitcoin_whitepaper_en.md","ref":"bitcoin_whitepaper_en.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-plus@^0.0.11","-highlight","-livereload","simple-page-toc@^0.1.1","github@^2.0.0","prism@^2.1.0","prism-themes@^0.0.2","advanced-emoji@^0.2.1","anchors@^0.7.1","include-codeblock@^3.0.2","ace@^0.3.2","emphasize@^1.1.0","splitter@^0.0.8","mermaid-gb3@2.1.0","tbfed-pagefooter@^0.0.1","sectionx@^3.1.0","local-video@^1.0.1","sitemap-general@^0.1.1","anchor-navigation-ex@0.1.8","todo@^0.1.3","3-ba@^0.9.0","terminal@^0.3.2","alerts@^0.2.0","include-csv@^0.1.0","puml@^1.0.1","klipse@^1.2.0","rss@^3.0.2","-sharing","sharing-plus@^0.0.2","graph@^0.1.0","chart@^0.2.0","ga","copy-code-button","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"李大狗 Leeduckgo © 2019 ","modify_label":"Last Modified: ","modify_format":"YYYY-MM-DD"},"prism":{"css":["prism-themes/themes/prism-base16-ateliersulphurpool.light.css"]},"include-csv":{},"emphasize":{},"ace":{},"github":{"url":"https://github.com/leeduckgo/bitcoin_elementary_course_based_on_jupyterlab.git"},"puml":{},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"todo":{},"splitter":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"graph":{},"sitemap-general":{"prefix":"https://bitcoin.doge.university/book"},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["gitbook"],"title":"基于 JupyterLab 的比特币及速入门指南","description":"进入区块链世界的绝佳入口","author":"李大狗","feed_url":"https://bitcoin.doge.university/book/sitmap.xml","site_url":"https://bitcoin.doge.university/book","managingEditor":"leeduckg@gmail.com","webMaster":"leeduckg@gmail.com"},"sectionx":{"tag":"b"},"mermaid-gb3":{},"anchor-navigation-ex":{"isRewritePageTitle":false,"isShowTocTitleIcon":true,"tocLevel1Icon":"fa fa-hand-o-right","tocLevel2Icon":"fa fa-hand-o-right","tocLevel3Icon":"fa fa-hand-o-right"},"prism-themes":{},"alerts":{},"3-ba":{"configuration":"auto","token":"e0f7e2879e5634cc0f587da6721b6860"},"mathjax":{"forceSVG":true},"local-video":{},"copy-code-button":{},"ga":{"configuration":"auto","token":"UA-123686345-1"},"klipse":{"myConfigKey":"it's the default value"},"advanced-emoji":{"embedEmojis":false},"include-codeblock":{"check":false,"edit":true,"fixlang":false,"lang":"","template":"ace","theme":"chrome","unindent":true},"sharing":{"qq":false,"all":["facebook","google","twitter","weibo","instapaper","linkedin","pocket","stumbleupon","qq","qzone"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"terminal":{"copyButtons":true,"fade":false,"style":"flat"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{},"chart":{"type":"c3"},"search-plus":{}},"theme":"default","author":"李大狗","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"基于 JupyterLab 的比特币极速入门指南","language":"zh-hans","output.name":"site","links":{"sidebar":{"Home":"https://bitcoin.doge.university"}},"gitbook":"3.2.3","description":"进入区块链世界的绝佳入口"},"file":{"path":"README.md","mtime":"2019-09-15T14:17:15.836Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-15T14:17:41.127Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ace/ace/ace.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ace/ace.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mermaid-gb3/book/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-local-video/video.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-terminal/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    <script src="gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.min.js"></script>

    </body>
</html>

